espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
/***************************************************************************//**
 * @file
 * @brief USB Device Core Operations
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include <stdlib.h>
#include <stddef.h>
#include <string.h>
#include <stdbool.h>
#include <stdint.h>

#include "sl_bit.h"
#include "sl_status.h"
#include "sl_string.h"

#include "em_core.h"

#include "sl_usbd_device_config.h"
#include "sl_usbd_core_config.h"
#include "sl_usbd_core.h"

#include "sli_usbd_core.h"
#include "sli_usbd_driver.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DEFINES
 ********************************************************************************************************
 *******************************************************************************************************/

#define  SLI_USBD_LOG_BUS_CH                   (USBD, BUS)

/********************************************************************************************************
 *                                       OBJECTS TOTAL NUMBER DEFINES
 *******************************************************************************************************/

#define  SLI_USBD_CONFIG_NBR_TOT                      (255u - 1u)
#define  SLI_USBD_INTERFACE_NBR_TOT                   (255u - 1u)
#define  SLI_USBD_ALT_INTERFACE_NBR_TOT               (255u - 1u)
#define  SLI_USBD_INTERFACE_GROUP_NBR_TOT             (255u - 1u)
#define  SLI_USBD_ENDPOINT_NBR_TOT                    (255u - 1u)

/********************************************************************************************************
 *                                           PROTOCOL DEFINES
 *
 * Note(s) : (1) The descriptor buffer is used to send the device, configuration and string descriptors.
 *
 *               (a) The size of the descriptor buffer is set to 64 which is the maximum packet size
 *                   allowed by the USB specification for FS and HS devices.
 *
 *           (2) USB spec 2.0 (section 9.6.3), table 9-10 specify the bitmap for the configuration
 *               attributes.
 *
 *                   D7    Reserved (set to one)
 *                   D6    Self-powered
 *                   D5    Remote Wakeup
 *                   D4..0 Reserved (reset to zero)
 *******************************************************************************************************/

#define  SLI_USBD_DESC_BUF_LEN                                    64u               // See Note #1a.
#define  SLI_USBD_ENDPOINT_CTRL_ALLOC                             (0x01u | 0x02u)   // (BIT_00 | BIT_01)

#define  SLI_USBD_CONFIG_DESC_SELF_POWERED                        0x40u             // BIT_06   See Note #2.
#define  SLI_USBD_CONFIG_DESC_REMOTE_WAKEUP                       0x20u             // BIT_05
#define  SLI_USBD_CONFIG_DESC_RSVD_SET                            0x80u             // BIT_07

// Microsoft Desc Define
#define  SLI_USBD_MICROSOFT_DESC_COMPAT_ID_HDR_VER_1_0            0x0010u
#define  SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_HDR_VER_1_0       0x000Au
#define  SLI_USBD_MICROSOFT_DESC_VER_1_0                          0x0100u

#define  SLI_USBD_MICROSOFT_STR_LEN                               18u               // Length of MS OS string.
#define  SLI_USBD_MICROSOFT_STR_IX                                0xEEu             // Index  of MS OS string.

#define  SLI_USBD_MICROSOFT_DESC_COMPAT_ID_HDR_LEN                16u
#define  SLI_USBD_MICROSOFT_DESC_COMPAT_ID_SECTION_LEN            24u

#define  SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_HDR_LEN           10u
#define  SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_SECTION_HDR_LEN   8u

#define  SLI_USBD_MICROSOFT_FEATURE_COMPAT_ID                     0x0004u
#define  SLI_USBD_MICROSOFT_FEATURE_EXT_PROPERTIES                0x0005u

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL CONSTANTS
 *
 * Note(s) : (1) For more information, see "Extended Compat id OS Feature Descriptor Specification",
 *               Appendix A, available at http://msdn.microsoft.com/en-us/windows/hardware/gg463179.aspx.
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                       DEFAULT CONFIGURATIONS
 *******************************************************************************************************/

#if (USBD_CFG_MS_OS_DESC_EN == 1)
// Signature used in MS OS string desc.
static const char usbd_microsoft_signature_str[] = "MSFT100";

static const char usbd_microsoft_compat_id[][8u] = {
  { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u },
  { 'R', 'N', 'D', 'I', 'S', 0u, 0u, 0u },
  { 'P', 'T', 'P', 0u, 0u, 0u, 0u, 0u },
  { 'M', 'T', 'P', 0u, 0u, 0u, 0u, 0u },
  { 'X', 'U', 'S', 'B', '2', '0', 0u, 0u },
  { 'B', 'L', 'U', 'T', 'U', 'T', 'H', 0u },
  { 'W', 'I', 'N', 'U', 'S', 'B', 0u, 0u },
};

static const char usbd_microsoft_subcompat_id[][8u] = {
  { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u },
  { '1', '1', 0u, 0u, 0u, 0u, 0u, 0u },
  { '1', '2', 0u, 0u, 0u, 0u, 0u, 0u },
  { 'E', 'D', 'R', 0u, 0u, 0u, 0u, 0u },
};
#endif

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL GLOBAL VARIABLES
 ********************************************************************************************************
 *******************************************************************************************************/

static sli_usbd_t usb_device;

static uint32_t descriptor_buffer[SLI_USBD_DESC_BUF_LEN / 4u] = { 0 };
static uint32_t ctrl_status_buffer = 0;

sli_usbd_t *usbd_ptr = NULL;

#if (SLI_USBD_CFG_DBG_STATS_EN == 1)
sl_usbd_debug_device_stats_t usbd_debug_stats_device;
sl_usbd_debug_endpoint_stats_t  usbd_debug_stats_endpoint_table[32u];
#endif

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

