espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
static sl_status_t usbd_core_add_device(void);

// Standard Request Handlers
static void usbd_core_stdreq_handler(sli_usbd_device_t *p_dev);

static bool usbd_core_device_stdreq(sli_usbd_device_t *p_dev,
                                    uint8_t           request);

static bool usbd_core_interface_stdreq(sli_usbd_device_t *p_dev,
                                       uint8_t           request);

static bool usbd_core_endpoint_stdreq(const sli_usbd_device_t *p_dev,
                                      uint8_t                 request);

static bool usbd_core_class_stdreq(const sli_usbd_device_t *p_dev);

static bool usbd_core_vendor_stdreq(const sli_usbd_device_t *p_dev);

#if (USBD_CFG_MS_OS_DESC_EN == 1)
static bool usbd_core_microsoft_device_stdreq(const sli_usbd_device_t *p_dev);

static bool usbd_core_microsoft_interface_stdreq(const sli_usbd_device_t *p_dev);

static bool usbd_core_microsoft_ext_property_stdreq(const sli_usbd_device_t  *p_dev,
                                                    sli_usbd_configuration_t *p_config,
                                                    uint8_t                  if_nbr,
                                                    uint16_t                 len);
#endif

static bool usbd_core_get_descriptor_stdreq(sli_usbd_device_t *p_dev);

static void usbd_core_unset_configuration(sli_usbd_device_t *p_dev);

static sl_status_t usbd_core_set_configuration(sli_usbd_device_t *p_dev,
                                               uint8_t           config_nbr);

static sl_status_t usbd_core_send_device_descriptor(sli_usbd_device_t *p_dev,
                                                    bool              other,
                                                    uint16_t          req_len);

static sl_status_t usbd_core_send_configuration_descriptor(sli_usbd_device_t *p_dev,
                                                           uint8_t           config_nbr,
                                                           bool              other,
                                                           uint16_t          req_len);

#if (USBD_CFG_STR_EN == 1)
static sl_status_t usbd_core_send_string_descriptor(sli_usbd_device_t   *p_dev,
                                                    uint8_t             str_ix,
                                                    uint16_t            req_len);

static sl_status_t usbd_core_add_string(sli_usbd_device_t *p_dev,
                                        const char        *p_str);

static uint8_t usbd_core_get_string_index(const sli_usbd_device_t *p_dev,
                                          const char              *p_str);

static const char *usbd_core_get_string_descriptor(const sli_usbd_device_t *p_dev,
                                                   uint8_t                 str_nbr);
#endif

static void usbd_core_start_descriptor_write(sli_usbd_device_t *p_dev,
                                             uint16_t          req_len);

static sl_status_t usbd_core_stop_descriptor_write(sli_usbd_device_t *p_dev);

static void usbd_core_write_08b_to_descriptor_buf(sli_usbd_device_t *p_dev,
                                                  uint8_t           val);

static void usbd_core_write_16b_to_descriptor_buf(sli_usbd_device_t *p_dev,
                                                  uint16_t          val);

static void usbd_core_write_to_descriptor_buf(sli_usbd_device_t *p_dev,
                                              const uint8_t     *p_buf,
                                              uint16_t          len);

// USB Object Functions
static sli_usbd_configuration_t *usbd_core_get_configuration_structure(const sli_usbd_device_t *p_dev,
                                                                       uint8_t                 config_nbr);

static sli_usbd_interface_t *usbd_core_get_interface_structure(const sli_usbd_configuration_t *p_config,
                                                               uint8_t                        if_nbr);

static sli_usbd_alt_interface_t *usbd_core_get_alt_interface_structure(const sli_usbd_interface_t *p_if,
                                                                       uint8_t                    if_alt_nbr);

static sl_status_t usbd_core_open_alt_interface(sli_usbd_device_t              *p_dev,
                                                uint8_t                        if_nbr,
                                                const sli_usbd_alt_interface_t *p_if_alt);

static void usbd_core_close_alt_interface(sli_usbd_device_t              *p_dev,
                                          const sli_usbd_alt_interface_t *p_if_alt);

static sli_usbd_interface_group_t *usbd_core_get_interface_group_structure(const sli_usbd_configuration_t *p_config,
                                                                           uint8_t                        if_grp_nbr);

static void usbd_core_set_event(sli_usbd_event_code_t event);

static void usbd_core_process_event(sli_usbd_device_t     *p_dev,
                                    sli_usbd_event_code_t event);

static sl_status_t usbd_core_add_endpoint(uint8_t  config_nbr,
                                          uint8_t  if_nbr,
                                          uint8_t  if_alt_nbr,
                                          uint8_t  attrib,
                                          bool     dir_in,
                                          uint16_t max_pkt_len,
                                          uint8_t  interval,
                                          uint8_t  *p_ep_addr);

static sl_status_t usbd_core_allocate_endpoint(sl_usbd_device_speed_t   spd,
                                               uint8_t                  type,
                                               bool                     dir_in,
                                               uint16_t                 max_pkt_len,
                                               uint8_t                  if_alt_nbr,
                                               sli_usbd_endpoint_info_t *p_ep,
                                               uint32_t                 *p_alloc_bit_map,
                                               bool                     *p_alloc);

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 * Initializes the USB device stack
 *******************************************************************************************************/
sl_status_t sl_usbd_core_init(void)
{
  sli_usbd_t         *p_usbd;
  sli_usbd_device_t     *p_dev;
  sli_usbd_configuration_t  *p_config;
  sli_usbd_interface_t      *p_if;
  sli_usbd_alt_interface_t  *p_if_alt;
  sli_usbd_interface_group_t  *p_if_grp;
  sli_usbd_endpoint_info_t *p_ep;
  uint16_t   tbl_ix;
  sl_status_t    status;
  CORE_DECLARE_IRQ_STATE;

  p_usbd = &usb_device;

  p_usbd->config_nbr_next = SL_USBD_CONFIGURATION_QUANTITY;
  p_usbd->interface_next = SL_USBD_INTERFACE_QUANTITY;
  p_usbd->alt_interface_nbr_next = SL_USBD_ALT_INTERFACE_QUANTITY;
#if (SL_USBD_INTERFACE_GROUP_QUANTITY > 0)
  p_usbd->interface_group_nbr_next = SL_USBD_INTERFACE_GROUP_QUANTITY;
#endif
  p_usbd->endpoint_info_nbr_next = SL_USBD_DESCRIPTOR_QUANTITY;
  p_usbd->std_req_timeout_ms = 5000u;

