espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  CORE_ENTER_ATOMIC();
  usbd_ptr = p_usbd;
  CORE_EXIT_ATOMIC();

  // Device Initialization
  p_dev = &usbd_ptr->device;
  // Default dev addr.
  p_dev->address = 0u;
  p_dev->state = SL_USBD_DEVICE_STATE_NONE;
  p_dev->state_prev = SL_USBD_DEVICE_STATE_NONE;
  p_dev->conn_status = false;
  p_dev->speed = SL_USBD_DEVICE_SPEED_INVALID;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  // Init HS & FS cfg list
  memset(p_dev->config_fs_speed_table_ptrs, 0, sizeof(sli_usbd_configuration_t *) * SL_USBD_CONFIGURATION_QUANTITY);
#if (USBD_CFG_HS_EN == 1)
  memset(p_dev->config_hs_speed_table_ptrs, 0, sizeof(sli_usbd_configuration_t *) * SL_USBD_CONFIGURATION_QUANTITY);
#endif

#else
  // linked-list implementation.
  p_dev->config_fs_head_ptr = NULL;
  p_dev->config_fs_tail_ptr = NULL;
#if (USBD_CFG_HS_EN == 1)
  p_dev->config_hs_head_ptr = NULL;
  p_dev->config_hs_tail_ptr = NULL;
#endif
#endif

  p_dev->config_cur_ptr = NULL;
  p_dev->config_cur_nbr = SL_USBD_CONFIG_NBR_NONE;
  p_dev->config_fs_total_nbr = 0u;
#if (USBD_CFG_HS_EN == 1)
  p_dev->config_hs_total_nbr = 0u;
#endif

  memset(p_dev->endpoint_interface_table, 0, (SL_USBD_ENDPOINT_MAX_NBR * (sizeof(uint8_t))));

  // Alloc desc buf from heap.
  p_dev->desc_buf_ptr = (uint8_t *)descriptor_buffer;
  if (p_dev->desc_buf_ptr == NULL) {
    return SL_STATUS_ALLOCATION_FAILED;
  }
  memset(p_dev->desc_buf_ptr, 0, SLI_USBD_DESC_BUF_LEN);

  // Alloc ctrl status buf from heap.
  p_dev->ctrl_status_buf_ptr = (uint8_t *)&ctrl_status_buffer;
  if (p_dev->ctrl_status_buf_ptr == NULL) {
    return SL_STATUS_ALLOCATION_FAILED;
  }

  p_dev->actual_buf_ptr = p_dev->desc_buf_ptr;
  p_dev->desc_buf_index = 0u;
  p_dev->desc_buf_req_len = 0u;
  p_dev->desc_buf_max_len = SLI_USBD_DESC_BUF_LEN;
  p_dev->desc_buf_status_ptr = NULL;

#if (SL_USBD_STRING_QUANTITY > 0)
  memset(p_dev->str_descriptor_table, 0, SL_USBD_STRING_QUANTITY * sizeof(char *));
  p_dev->str_max_index = 0u;
#endif
#if (USBD_CFG_MS_OS_DESC_EN == 1)
  p_dev->str_microsoft_vendor_code = 0u;
#endif

  memset(&p_dev->setup_req, 0, sizeof(sl_usbd_setup_req_t));

  memset(&p_dev->setup_req_next, 0, sizeof(sl_usbd_setup_req_t));

  p_dev->endpoint_max_ctrl_pkt_size = 0u;
  p_dev->endpoint_max_phy_nbr = 0u;

  memset(p_dev->endpoint_interface_table, SL_USBD_INTERFACE_NBR_NONE, SL_USBD_ENDPOINT_MAX_NBR);

  p_dev->self_power = false;
  p_dev->remote_wakeup = 0u;

  SLI_USBD_DBG_STATS_DEV_RESET();

  // Configuration Table Initialization
  for (tbl_ix = 0u; tbl_ix < SL_USBD_CONFIGURATION_QUANTITY; tbl_ix++) {
    p_config = &usbd_ptr->config_table[tbl_ix];
    p_config->attrib = 0x00u;
    p_config->max_power = 0u;
    p_config->desc_len = 0u;

#if (USBD_CFG_STR_EN == 1)
    p_config->name_ptr = NULL;
#endif

// Init IF list
#if (USBD_CFG_OPTIMIZE_SPD == 1)
    // array implementation.
    memset(p_config->interface_table_ptrs, 0, sizeof(sli_usbd_interface_t *) * SL_USBD_INTERFACE_QUANTITY);

#if (SL_USBD_INTERFACE_GROUP_QUANTITY > 0u)
    memset(p_config->interface_group_table_ptrs, 0, sizeof(sli_usbd_interface_group_t*) * SL_USBD_INTERFACE_GROUP_QUANTITY);
#endif
#else
    // linked-list implementation.
    p_config->interface_head_ptr = NULL;
    p_config->interface_tail_ptr = NULL;
    p_config->interface_group_head_ptr = NULL;
    p_config->interface_group_tail_ptr = NULL;
    p_config->next_ptr = NULL;
#endif
    p_config->interface_nbr_total = 0u;
    p_config->interface_group_nbr_total = 0u;
    p_config->endpoint_alloc_map = 0x00u;
#if (USBD_CFG_HS_EN == 1)
    p_config->config_other_speed = SL_USBD_CONFIG_NBR_NONE;
#endif
  }
  // Interface Table Initialization
  for (tbl_ix = 0u; tbl_ix < SL_USBD_INTERFACE_QUANTITY; tbl_ix++) {
    p_if = &usbd_ptr->interface_table[tbl_ix];
    p_if->class_code = SL_USBD_CLASS_CODE_USE_IF_DESC;
    p_if->class_sub_code = SL_USBD_SUBCLASS_CODE_USE_IF_DESC;
    p_if->class_protocol_code = SL_USBD_PROTOCOL_CODE_USE_IF_DESC;
    p_if->class_driver_ptr = NULL;
    p_if->class_arg_ptr = NULL;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
    memset(p_if->alt_table_ptrs, 0, sizeof(sli_usbd_alt_interface_t *) * SL_USBD_ALT_INTERFACE_QUANTITY);
#else
    p_if->alt_head_ptr = NULL;
    p_if->alt_tail_ptr = NULL;
#endif
    p_if->alt_cur_ptr = NULL;
    p_if->alt_cur = SL_USBD_ALT_INTERFACE_NBR_NONE;
    p_if->alt_nbr_total = 0u;
    p_if->group_nbr = SL_USBD_INTERFACE_GROUP_NBR_NONE;
    p_if->endpoint_alloc_map = 0x00u;
#if (USBD_CFG_OPTIMIZE_SPD == 0)
    p_if->next_ptr = NULL;
#endif
  }
  // Alternate Settings Table Initialization
  for (tbl_ix = 0u; tbl_ix < SL_USBD_ALT_INTERFACE_QUANTITY; tbl_ix++) {
    p_if_alt = &usbd_ptr->alt_interface_table[tbl_ix];
    p_if_alt->class_arg_ptr = NULL;
    p_if_alt->endpoint_alloc_map = 0x00u;
    p_if_alt->endpoint_nbr_total = 0u;
#if (USBD_CFG_STR_EN == 1)
    p_if_alt->name_ptr = NULL;
#endif
#if (USBD_CFG_OPTIMIZE_SPD == 0)
    p_if_alt->next_ptr = NULL;
#endif
#if (USBD_CFG_OPTIMIZE_SPD == 1)
    memset(p_if_alt->endpoint_table_ptrs, 0, SL_USBD_ENDPOINT_MAX_NBR * sizeof(sli_usbd_endpoint_info_t *));
    p_if_alt->endpoint_table_map = 0u;
#else
    p_if_alt->endpoint_head_ptr = NULL;
    p_if_alt->endpoint_tail_ptr = NULL;
#endif
  }

#if (SL_USBD_INTERFACE_GROUP_QUANTITY > 0u)
  // Interface Group Table Initialization
  for (tbl_ix = 0u; tbl_ix < SL_USBD_INTERFACE_GROUP_QUANTITY; tbl_ix++) {
    p_if_grp = &usbd_ptr->interface_group_table[tbl_ix];
    p_if_grp->class_code = SL_USBD_CLASS_CODE_USE_IF_DESC;
    p_if_grp->class_sub_code = SL_USBD_SUBCLASS_CODE_USE_IF_DESC;
    p_if_grp->class_protocol_code = SL_USBD_PROTOCOL_CODE_USE_IF_DESC;
    p_if_grp->interface_start = SL_USBD_INTERFACE_NBR_NONE;
    p_if_grp->interface_count = 0u;
#if (USBD_CFG_STR_EN == 1)
    p_if_grp->name_ptr = NULL;
#endif
#if (USBD_CFG_OPTIMIZE_SPD == 0)
    p_if_grp->next_ptr = NULL;
#endif
  }
#endif

  // Endpoint Information Table Initialization
  for (tbl_ix = 0u; tbl_ix < SL_USBD_DESCRIPTOR_QUANTITY; tbl_ix++) {
    p_ep = &usbd_ptr->endpoint_info_table[tbl_ix];
    p_ep->address = SL_USBD_ENDPOINT_NBR_NONE;
    p_ep->attrib = 0x00u;
    p_ep->interval = 0u;
    // Default sync addr is zero.
    p_ep->sync_addr = 0u;
    // Default feedback rate exponent is zero.
    p_ep->sync_refresh = 0u;
#if (USBD_CFG_OPTIMIZE_SPD == 0)
    p_ep->next_ptr = NULL;
#endif
  }

#if (USBD_CFG_STR_EN == 1)
  usbd_ptr->str_quantity_per_device = SL_USBD_STRING_QUANTITY;
#endif

  status = sli_usbd_core_init_endpoint();
  if (status != SL_STATUS_OK) {
    return status;
  }

  status = usbd_core_add_device();
  if (status != SL_STATUS_OK) {
    return status;
  }

