espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Starts the device stack
 *******************************************************************************************************/
sl_status_t sl_usbd_core_start_device(void)
{
  sli_usbd_device_t     *p_dev;
  bool   init;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE)
      && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    return SL_STATUS_INVALID_STATE;
  }

  init = false;

  // If dev not initialized, call dev drv 'Init()' function.
  if (p_dev->state == SL_USBD_DEVICE_STATE_NONE) {
    status = sli_usbd_driver_init();
    if (status != SL_STATUS_OK) {
      return status;
    }

    init = true;
  }

  status = sli_usbd_driver_start();

  if (init == true) {
    CORE_ENTER_ATOMIC();
    p_dev->state = SL_USBD_DEVICE_STATE_INIT;
    CORE_EXIT_ATOMIC();
  }

  return status;
}

/****************************************************************************************************//**
 * Stops the device stack
 *******************************************************************************************************/
sl_status_t sl_usbd_core_stop_device(void)
{
  sli_usbd_device_t     *p_dev;
  sl_status_t    status;
  CORE_DECLARE_IRQ_STATE;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->state == SL_USBD_DEVICE_STATE_NONE) {
    return SL_STATUS_INVALID_STATE;
  }

  // Close curr cfg.
  usbd_core_unset_configuration(p_dev);
  status = sli_usbd_driver_stop();

  CORE_ENTER_ATOMIC();
  // Re-init dev stack to 'INIT' state.
  p_dev->state = SL_USBD_DEVICE_STATE_INIT;
  p_dev->state_prev = SL_USBD_DEVICE_STATE_INIT;
  p_dev->conn_status = false;
  CORE_EXIT_ATOMIC();

  return status;
}

/****************************************************************************************************//**
 * Adds a configuration attribute to the device
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_configuration(uint8_t                  attrib,
                                           uint16_t                 max_pwr,
                                           sl_usbd_device_speed_t   spd,
                                           const char               *p_name,
                                           uint8_t                  *p_cfg_nbr)
{
  sli_usbd_device_t      *p_dev;
  sli_usbd_configuration_t   *p_config;
  uint8_t    config_tbl_ix;
  uint8_t    config_nbr;
  sl_usbd_device_speed_t  drv_spd;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

#if (USBD_CFG_HS_EN == 0)
  (void)&spd;
  (void)&drv_spd;
#endif

  if (p_cfg_nbr == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk max pwr (see Note #1).
  if (max_pwr > SL_USBD_MAX_BUS_PWR_LIMIT_mA) {
    *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE)
      && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
    return SL_STATUS_INVALID_STATE;
  }

// Chk if dev supports high spd.
#if (USBD_CFG_HS_EN == 1)
  sli_usbd_driver_get_speed(&drv_spd);
  if ((drv_spd != SL_USBD_DEVICE_SPEED_HIGH)
      && (spd == SL_USBD_DEVICE_SPEED_HIGH)) {
    *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }
#endif

  CORE_ENTER_ATOMIC();
  // Chk if cfg is avail.
  if (usbd_ptr->config_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  config_tbl_ix = usbd_ptr->config_nbr_next - 1u;

#if (USBD_CFG_HS_EN == 1)
  // Add cfg to dev HS cfg.
  if (spd == SL_USBD_DEVICE_SPEED_HIGH) {
    config_nbr = p_dev->config_hs_total_nbr;
    // Chk cfg limit.
    if (config_nbr > SLI_USBD_CONFIG_NBR_TOT) {
      CORE_EXIT_ATOMIC();
      *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
      return SL_STATUS_ALLOCATION_FAILED;
    }
    p_dev->config_hs_total_nbr++;
  } else {
#endif
  // FS cfg.
  config_nbr = p_dev->config_fs_total_nbr;
  // Chk cfg limit.
  if (config_nbr > SLI_USBD_CONFIG_NBR_TOT) {
    CORE_EXIT_ATOMIC();
    *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  p_dev->config_fs_total_nbr++;
#if (USBD_CFG_HS_EN == 1)
}
#endif
  usbd_ptr->config_nbr_next--;

  // Configuration Structure Initialization
  p_config = &usbd_ptr->config_table[config_tbl_ix];

  // Link cfg into dev struct.
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  CORE_EXIT_ATOMIC();

#if (USBD_CFG_HS_EN == 1)
  if (spd == SL_USBD_DEVICE_SPEED_HIGH) {
    p_dev->config_hs_speed_table_ptrs[config_nbr] = p_config;
    // Set spd bit in cfg nbr.
    SL_SET_BIT(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT);
  } else {
#endif
  p_dev->config_fs_speed_table_ptrs[config_nbr] = p_config;
#if (USBD_CFG_HS_EN == 1)
}
#endif

#else
  p_config->next_ptr = NULL;

#if (USBD_CFG_HS_EN == 1)
  if (spd == SL_USBD_DEVICE_SPEED_HIGH) {
    // Link cfg in HS list.
    if (p_dev->config_hs_head_ptr == NULL) {
      p_dev->config_hs_head_ptr = p_config;
      p_dev->config_hs_tail_ptr = p_config;
    } else {
      p_dev->config_hs_tail_ptr->next_ptr = p_config;
      p_dev->config_hs_tail_ptr = p_config;
    }
    // Set spd bit in cfg nbr.
    SL_SET_BIT(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT);
  } else {
#endif
  // Link cfg in FS list.
  if (p_dev->config_fs_head_ptr == NULL) {
    p_dev->config_fs_head_ptr = p_config;
    p_dev->config_fs_tail_ptr = p_config;
  } else {
    p_dev->config_fs_tail_ptr->next_ptr = p_config;
    p_dev->config_fs_tail_ptr = p_config;
  }
#if (USBD_CFG_HS_EN == 1)
}
#endif
  CORE_EXIT_ATOMIC();
#endif

#if (USBD_CFG_STR_EN == 1)
  p_config->name_ptr = p_name;
#endif

  p_config->attrib = attrib;
  // Init EP alloc bitmap.
  p_config->endpoint_alloc_map = SLI_USBD_ENDPOINT_CTRL_ALLOC;
  p_config->max_power = max_pwr;
  // Init cfg desc len.
  p_config->desc_len = 0u;

#if (USBD_CFG_STR_EN == 1)
  // Add cfg string to dev.
  status = usbd_core_add_string(p_dev, p_name);
  if (status != SL_STATUS_OK) {
    *p_cfg_nbr = SL_USBD_CONFIG_NBR_NONE;
    return status;
  }
#else
  (void)&p_name;
#endif

  *p_cfg_nbr = config_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Associate a configuration with its alternative-speed counterpart
 *******************************************************************************************************/
#if (USBD_CFG_HS_EN == 1)
sl_status_t sl_usbd_core_associate_other_speed_configuration(uint8_t config_nbr,
                                                             uint8_t config_other)
{
  sli_usbd_device_t    *p_dev;
  sli_usbd_configuration_t *p_config;
  sli_usbd_configuration_t *p_config_other;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE)
      && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    return SL_STATUS_INVALID_STATE;
  }

