espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  // Chk if both cfg are from same spd.
  if (((config_nbr & SL_USBD_CONFIG_NBR_SPD_BIT) ^ (config_other & SL_USBD_CONFIG_NBR_SPD_BIT)) != SL_USBD_CONFIG_NBR_SPD_BIT) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);

  if (p_config == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_config_other = usbd_core_get_configuration_structure(p_dev, config_other);

  if (p_config_other == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk if cfg already associated.
  if (!((p_config->config_other_speed == SL_USBD_CONFIG_NBR_NONE)
        && (p_config_other->config_other_speed == SL_USBD_CONFIG_NBR_NONE))) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_config->config_other_speed = config_other;
  p_config_other->config_other_speed = config_nbr;

  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 * Gets the current device state
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_state(sl_usbd_device_state_t *p_dev_state)
{
  sli_usbd_device_t *p_dev;

  if (p_dev_state == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  *p_dev_state = p_dev->state;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Get device speed
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_speed(sl_usbd_device_speed_t *p_dev_speed)
{
  sli_usbd_device_t *p_dev;

  if (p_dev_speed == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->state == SL_USBD_DEVICE_STATE_NONE) {
    *p_dev_speed = SL_USBD_DEVICE_SPEED_INVALID;
    return SL_STATUS_INVALID_STATE;
  }

  *p_dev_speed = p_dev->speed;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sets the device's current power source
 *******************************************************************************************************/
sl_status_t sl_usbd_core_set_device_self_power(bool self_pwr)
{
  sli_usbd_device_t *p_dev;
  CORE_DECLARE_IRQ_STATE;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  CORE_ENTER_ATOMIC();
  p_dev->self_power = self_pwr;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Set the device's Microsoft vendor code
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
sl_status_t sl_usbd_core_set_device_microsoft_vendor_code(uint8_t vendor_code)
{
  sli_usbd_device_t *p_dev;
  CORE_DECLARE_IRQ_STATE;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  CORE_ENTER_ATOMIC();
  p_dev->str_microsoft_vendor_code = vendor_code;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 * Get device configuration
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_configuration(sl_usbd_device_config_t **p_dev_cfg)
{
  sli_usbd_device_t *p_dev;

  if (p_dev_cfg == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  *p_dev_cfg = &p_dev->device_config;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Gets the last frame number from the driver
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_frame_number(uint16_t *p_frame_nbr)
{
  sli_usbd_device_t     *p_dev;

  if (p_frame_nbr == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->state == SL_USBD_DEVICE_STATE_NONE) {
    *p_frame_nbr = 0;
    return SL_STATUS_INVALID_STATE;
  }

  sli_usbd_driver_get_frame_number(p_frame_nbr);

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds an interface to a specific configuration
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_interface(uint8_t                cfg_nbr,
                                       sl_usbd_class_driver_t *p_class_drv,
                                       void                   *p_if_class_arg,
                                       void                   *p_if_alt_class_arg,
                                       uint8_t                class_code,
                                       uint8_t                class_sub_code,
                                       uint8_t                class_protocol_code,
                                       const char             *p_name,
                                       uint8_t                *p_if_nbr)
{
  uint8_t  if_tbl_ix;
  uint8_t  if_nbr;
  uint8_t  if_alt_nbr;
  sli_usbd_device_t    *p_dev;
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t     *p_if;
  sli_usbd_alt_interface_t *p_if_alt;
  sl_status_t    status;
  CORE_DECLARE_IRQ_STATE;

  if (p_if_nbr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (p_class_drv == NULL) {
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_NULL_POINTER;
  }

  // Chk if interface_descriptor() & interface_get_descriptor_size() are present or not.
  if (!(((p_class_drv->interface_descriptor == NULL) && (p_class_drv->interface_get_descriptor_size == NULL))
        || ((p_class_drv->interface_descriptor != NULL) && (p_class_drv->interface_get_descriptor_size != NULL)))) {
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_NULL_POINTER;
  }

  // Chk if endpoint_descriptor() & endpoint_get_descriptor_size() are present or not.
  if (!(((p_class_drv->endpoint_descriptor == NULL) && (p_class_drv->endpoint_get_descriptor_size == NULL))
        || ((p_class_drv->endpoint_descriptor != NULL) && (p_class_drv->endpoint_get_descriptor_size != NULL)))) {
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_NULL_POINTER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE) && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_INVALID_STATE;
  }

  // Get cfg struct.
  p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr);

  if (p_config == NULL) {
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

