espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  CORE_ENTER_ATOMIC();
  // Chk if IF struct is avail.
  if (usbd_ptr->interface_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  if_tbl_ix = usbd_ptr->interface_next - 1u;

  // Chk if IF alt struct is avail.
  if (usbd_ptr->alt_interface_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  if_alt_nbr = usbd_ptr->alt_interface_nbr_next - 1u;

  // Get next IF nbr in cfg.
  if_nbr = p_config->interface_nbr_total;
  // Chk IF limit.
  if (if_nbr > SLI_USBD_INTERFACE_NBR_TOT) {
    CORE_EXIT_ATOMIC();
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }

  usbd_ptr->interface_next--;
  usbd_ptr->alt_interface_nbr_next--;
  p_config->interface_nbr_total++;

  p_if = &usbd_ptr->interface_table[if_tbl_ix];
  // Get IF alt struct (see Note #1).
  p_if_alt = &usbd_ptr->alt_interface_table[if_alt_nbr];

  // Link IF and alt setting.
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  CORE_EXIT_ATOMIC();

  p_config->interface_table_ptrs[if_nbr] = p_if;
  p_if->alt_table_ptrs[0u] = p_if_alt;
#else
  p_if->next_ptr = NULL;
  p_if_alt->next_ptr = NULL;
  p_if->alt_head_ptr = p_if_alt;
  p_if->alt_tail_ptr = p_if_alt;

  if (p_config->interface_head_ptr == NULL) {
    p_config->interface_head_ptr = p_if;
    p_config->interface_tail_ptr = p_if;
  } else {
    p_config->interface_tail_ptr->next_ptr = p_if;
    p_config->interface_tail_ptr = p_if;
  }
  CORE_EXIT_ATOMIC();
#endif

  p_if->class_code = class_code;
  p_if->class_sub_code = class_sub_code;
  p_if->class_protocol_code = class_protocol_code;
  p_if->class_driver_ptr = p_class_drv;
  p_if->class_arg_ptr = p_if_class_arg;
  p_if->endpoint_alloc_map = SLI_USBD_ENDPOINT_CTRL_ALLOC;
  // Set curr alt setting.
  p_if->alt_cur_ptr = p_if_alt;
  p_if->alt_cur = 0u;
  p_if->alt_nbr_total = 1u;
  p_if_alt->endpoint_alloc_map = p_if->endpoint_alloc_map;
  p_if_alt->class_arg_ptr = p_if_alt_class_arg;

#if (USBD_CFG_STR_EN == 1)
  p_if_alt->name_ptr = p_name;
#endif

  // Add IF string to dev.
#if (USBD_CFG_STR_EN == 1)
  status = usbd_core_add_string(p_dev, p_name);
  if (status != SL_STATUS_OK) {
    *p_if_nbr = SL_USBD_INTERFACE_NBR_NONE;
    return status;
  }
#else
  (void)&p_name;
#endif

  *p_if_nbr = if_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds an alternate setting to a specific interface
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_alt_interface(uint8_t     config_nbr,
                                           uint8_t     if_nbr,
                                           void        *p_class_arg,
                                           const char  *p_name,
                                           uint8_t     *p_if_alt_nbr)
{
  sli_usbd_device_t    *p_dev;
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t     *p_if;
  sli_usbd_alt_interface_t *p_if_alt;
  uint8_t  if_alt_tbl_ix;
  uint8_t  if_alt_nbr;
  sl_status_t   status;
  CORE_DECLARE_IRQ_STATE;

  if (p_if_alt_nbr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  // Get Object References

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Get config struct.
  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);

  if (p_config == NULL) {
    *p_if_alt_nbr = SL_USBD_ALT_INTERFACE_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get config struct.
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);

  if (p_if == NULL) {
    *p_if_alt_nbr = SL_USBD_ALT_INTERFACE_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  CORE_ENTER_ATOMIC();
  // Chk if next alt setting is avail.
  if (usbd_ptr->alt_interface_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_if_alt_nbr = SL_USBD_ALT_INTERFACE_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  if_alt_tbl_ix = usbd_ptr->alt_interface_nbr_next - 1u;

  // Chk if alt setting is avail.
  if_alt_nbr = p_if->alt_nbr_total;
  if (if_alt_nbr > SLI_USBD_ALT_INTERFACE_NBR_TOT) {
    CORE_EXIT_ATOMIC();
    *p_if_alt_nbr = SL_USBD_ALT_INTERFACE_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }

  usbd_ptr->alt_interface_nbr_next--;
  p_if->alt_nbr_total++;

  p_if_alt = &usbd_ptr->alt_interface_table[if_alt_tbl_ix];

  // Add alt setting to IF.
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  CORE_EXIT_ATOMIC();

  p_if->alt_table_ptrs[if_alt_nbr] = p_if_alt;
#else
  p_if_alt->next_ptr = NULL;

  p_if->alt_tail_ptr->next_ptr = p_if_alt;
  p_if->alt_tail_ptr = p_if_alt;
  CORE_EXIT_ATOMIC();
#endif

  p_if_alt->class_arg_ptr = p_class_arg;
  p_if_alt->endpoint_alloc_map = SLI_USBD_ENDPOINT_CTRL_ALLOC;

#if (USBD_CFG_STR_EN == 1)
  p_if_alt->name_ptr = p_name;
#endif

  p_if_alt->endpoint_alloc_map &= ~p_if->endpoint_alloc_map;
  p_if_alt->endpoint_alloc_map |= SLI_USBD_ENDPOINT_CTRL_ALLOC;

#if (USBD_CFG_STR_EN == 1)
  // Add alt setting string to dev.
  status = usbd_core_add_string(p_dev, p_name);
  if (status != SL_STATUS_OK) {
    *p_if_alt_nbr = SL_USBD_ALT_INTERFACE_NBR_NONE;
    return status;
  }
#else
  (void)&p_name;
#endif

  *p_if_alt_nbr = if_alt_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Creates an interface group
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_interface_group(uint8_t      config_nbr,
                                             uint8_t      class_code,
                                             uint8_t      class_sub_code,
                                             uint8_t      class_protocol_code,
                                             uint8_t      if_start,
                                             uint8_t      if_cnt,
                                             const char   *p_name,
                                             uint8_t      *p_if_grp_num)
{
  sli_usbd_device_t    *p_dev;
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t     *p_if;
  sli_usbd_interface_group_t *p_if_grp;
  uint8_t  if_grp_tbl_ix;
  uint8_t  if_grp_nbr;
  uint8_t  if_nbr;
  uint8_t  if_end;
  sl_status_t   status;
  CORE_DECLARE_IRQ_STATE;

  if (p_if_grp_num == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

