espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  if (((uint16_t)(if_start) + (uint16_t)(if_cnt)) > (uint16_t)SLI_USBD_INTERFACE_NBR_TOT) {
    *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get Object References

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Get cfg struct.
  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);

  if (p_config == NULL) {
    *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Verify that IFs do NOT belong to another group.
  for (if_nbr = 0u; if_nbr < if_cnt; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr + if_start);

    if (p_if == NULL) {
      *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
      return SL_STATUS_INVALID_PARAMETER;
    }

    if (p_if->group_nbr != SL_USBD_INTERFACE_GROUP_NBR_NONE) {
      *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
      return SL_STATUS_ALREADY_EXISTS;
    }
  }

  CORE_ENTER_ATOMIC();

  // Chk if IF grp is avail.
  if (usbd_ptr->interface_group_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  usbd_ptr->interface_group_nbr_next--;
  if_grp_tbl_ix = usbd_ptr->interface_group_nbr_next;

  p_if_grp = &usbd_ptr->interface_group_table[if_grp_tbl_ix];

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  if_grp_nbr = p_config->interface_group_nbr_total;
  p_config->interface_group_nbr_total++;
  CORE_EXIT_ATOMIC();

  p_config->interface_group_table_ptrs[if_grp_nbr] = p_if_grp;
#else
  p_if_grp->next_ptr = NULL;

  if_grp_nbr = p_config->interface_group_nbr_total;
  p_config->interface_group_nbr_total++;

  if (if_grp_nbr == 0u) {
    p_config->interface_group_head_ptr = p_if_grp;
    p_config->interface_group_tail_ptr = p_if_grp;
  } else {
    p_config->interface_group_tail_ptr->next_ptr = p_if_grp;
    p_config->interface_group_tail_ptr = p_if_grp;
  }
  CORE_EXIT_ATOMIC();
#endif

  p_if_grp->class_code = class_code;
  p_if_grp->class_sub_code = class_sub_code;
  p_if_grp->class_protocol_code = class_protocol_code;
  p_if_grp->interface_start = if_start;
  p_if_grp->interface_count = if_cnt;

#if (USBD_CFG_STR_EN == 1)
  p_if_grp->name_ptr = p_name;
#endif

  if_end = if_cnt + if_start;
  for (if_nbr = if_start; if_nbr < if_end; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);

    if (p_if == NULL) {
      *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
      return SL_STATUS_INVALID_PARAMETER;
    }

    if (p_if->group_nbr != SL_USBD_INTERFACE_GROUP_NBR_NONE) {
      *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
      return SL_STATUS_ALREADY_EXISTS;
    }

    CORE_ENTER_ATOMIC();
    p_if->group_nbr = if_grp_nbr;
    CORE_EXIT_ATOMIC();
  }

#if (USBD_CFG_STR_EN == 1)
  // Add IF grp string to dev.
  status = usbd_core_add_string(p_dev, p_name);
  if (status != SL_STATUS_OK) {
    *p_if_grp_num = SL_USBD_INTERFACE_GROUP_NBR_NONE;
    return status;
  }
#else
  (void)&p_name;
#endif

  *p_if_grp_num = if_grp_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Gets the device descriptor
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_descriptor(uint8_t *p_buf,
                                               uint8_t max_len,
                                               uint8_t *p_desc_len)
{
  sli_usbd_device_t   *p_dev;
  sl_status_t   status;
  sl_status_t   local_status;

  local_status = SL_STATUS_OK;

  if (p_desc_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (p_buf == NULL) {
    *p_desc_len = 0;
    return SL_STATUS_NULL_POINTER;
  }

  if (max_len == 0) {
    *p_desc_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->state != SL_USBD_DEVICE_STATE_NONE) {
    *p_desc_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  p_dev->actual_buf_ptr = p_buf;
  p_dev->desc_buf_max_len = max_len;
  p_dev->desc_buf_status_ptr = &local_status;

  status = usbd_core_send_device_descriptor(p_dev, false, max_len);

  p_dev->desc_buf_status_ptr = NULL;

  *p_desc_len = p_dev->desc_buf_index;
  return status;
}

/****************************************************************************************************//**
 * Gets a configuration descriptor
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_configuration_descriptor(uint8_t  *p_buf,
                                                      uint16_t max_len,
                                                      uint8_t  config_ix,
                                                      uint16_t *p_desc_len)
{
  sli_usbd_device_t   *p_dev;
  sl_status_t   local_status;
  sl_status_t   status;

  local_status = SL_STATUS_OK;

  if (p_desc_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (p_buf == NULL) {
    *p_desc_len = 0;
    return SL_STATUS_NULL_POINTER;
  }

  if (max_len == 0) {
    *p_desc_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->state != SL_USBD_DEVICE_STATE_NONE) {
    *p_desc_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  p_dev->actual_buf_ptr = p_buf;
  p_dev->desc_buf_max_len = max_len;
  p_dev->desc_buf_status_ptr = &local_status;

  status = usbd_core_send_configuration_descriptor(p_dev, config_ix, false, max_len);

  p_dev->desc_buf_status_ptr = NULL;

  *p_desc_len = p_dev->desc_buf_index;
  return status;
}

/****************************************************************************************************//**
 * Get a string descriptor
 *******************************************************************************************************/
#if (USBD_CFG_STR_EN == 1)
sl_status_t sl_usbd_core_get_string_descriptor(uint8_t *p_buf,
                                               uint8_t max_len,
                                               uint8_t str_ix,
                                               uint8_t *p_desc_len)
{
  sli_usbd_device_t   *p_dev;
  sl_status_t   local_status;
  sl_status_t   status;

  local_status = SL_STATUS_OK;

  if (p_desc_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (p_buf == NULL) {
    *p_desc_len = 0;
    return SL_STATUS_NULL_POINTER;
  }

  if (max_len == 0) {
    *p_desc_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->state != SL_USBD_DEVICE_STATE_NONE) {
    *p_desc_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  p_dev->actual_buf_ptr = p_buf;
  p_dev->desc_buf_max_len = max_len;
  p_dev->desc_buf_status_ptr = &local_status;

  status = usbd_core_send_string_descriptor(p_dev, str_ix, max_len);

  p_dev->desc_buf_status_ptr = NULL;

  *p_desc_len = p_dev->desc_buf_index;
  return status;
}
#endif

/****************************************************************************************************//**
 * Add string to USB device
 *******************************************************************************************************/
#if (USBD_CFG_STR_EN == 1)
sl_status_t sl_usbd_core_add_string(const char *p_str)
{
  sli_usbd_device_t  *p_dev;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE)
      && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    return SL_STATUS_INVALID_STATE;
  }

  return usbd_core_add_string(p_dev, p_str);
}
#endif

/****************************************************************************************************//**
 * Get string index corresponding to a given string
 *******************************************************************************************************/
#if (USBD_CFG_STR_EN == 1)
sl_status_t sl_usbd_core_get_string_index(const char  *p_str,
                                          uint8_t     *p_str_ix)
{
  sli_usbd_device_t   *p_dev;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  *p_str_ix = usbd_core_get_string_index(p_dev, p_str);

