espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 * Writes an 8-bit value to the descriptor buffer
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_08b_to_descriptor_buf(uint8_t val)
{
  sli_usbd_device_t  *p_dev;
  sl_status_t  status;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  status = *(p_dev->desc_buf_status_ptr);

  if (status == SL_STATUS_OK) {
    usbd_core_write_to_descriptor_buf(p_dev, &val, 1u);
  }

  return status;
}

/****************************************************************************************************//**
 * Writes a 16-bit value in the descriptor buffer
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_16b_to_descriptor_buf(uint16_t val)
{
  sli_usbd_device_t *p_dev;
  sl_status_t  status;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  status = *(p_dev->desc_buf_status_ptr);

  if (status == SL_STATUS_OK) {
    uint8_t buf[2u];

    buf[0u] = (uint8_t)(val        & 0xFFu);
    buf[1u] = (uint8_t)((val >> 8u) & 0xFFu);

    usbd_core_write_to_descriptor_buf(p_dev, &buf[0u], 2u);
  }

  return status;
}

/****************************************************************************************************//**
 * Writes a 24-bit value to the descriptor buffer
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_24b_to_descriptor_buf(uint32_t val)
{
  sli_usbd_device_t *p_dev;
  sl_status_t  status;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  status = *(p_dev->desc_buf_status_ptr);

  if (status == SL_STATUS_OK) {
    uint8_t buf[3u];

    buf[0u] = (uint8_t)(val         & 0xFFu);
    buf[1u] = (uint8_t)((val >> 8u)  & 0xFFu);
    buf[2u] = (uint8_t)((val >> 16u) & 0xFFu);

    usbd_core_write_to_descriptor_buf(p_dev, &buf[0u], 3u);
  }

  return status;
}

/****************************************************************************************************//**
 * Writes a 24-bit value to the descriptor buffer
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_32b_to_descriptor_buf(uint32_t val)
{
  sli_usbd_device_t *p_dev;
  sl_status_t  status;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  status = *(p_dev->desc_buf_status_ptr);

  if (status == SL_STATUS_OK) {
    uint8_t buf[4u];

    buf[0u] = (uint8_t)(val         & 0xFFu);
    buf[1u] = (uint8_t)((val >> 8u) & 0xFFu);
    buf[2u] = (uint8_t)((val >> 16u) & 0xFFu);
    buf[3u] = (uint8_t)((val >> 24u) & 0xFFu);

    usbd_core_write_to_descriptor_buf(p_dev, &buf[0u], 4u);
  }

  return status;
}

/****************************************************************************************************//**
 * Writes a buffer into the descriptor buffer
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_buf_to_descriptor_buf(const uint8_t  *p_buf,
                                                     uint16_t       len)
{
  sli_usbd_device_t *p_dev;
  sl_status_t  status;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if ((p_buf == NULL) || (len == 0u)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  status = *(p_dev->desc_buf_status_ptr);

  if (status == SL_STATUS_OK) {
    usbd_core_write_to_descriptor_buf(p_dev, p_buf, len);
  }

  return status;
}

/****************************************************************************************************//**
 * Adds a bulk endpoint to alternate setting interface
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_bulk_endpoint(uint8_t   config_nbr,
                                           uint8_t   if_nbr,
                                           uint8_t   if_alt_nbr,
                                           bool      dir_in,
                                           uint16_t  max_pkt_len,
                                           uint8_t   *p_ep_addr)
{
  if (p_ep_addr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

#if (USBD_CFG_HS_EN == 1)
  // Chk EP size.
  // SL_USBD_CONFIG_NBR_SPD_BIT will always be clear in FS.
  if (((max_pkt_len != 0u) && (max_pkt_len != 512u))
      && (SL_IS_BIT_SET(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT))) {
    *p_ep_addr = SL_USBD_ENDPOINT_ADDR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }
#endif

#if (USBD_CFG_HS_EN == 1)
  if (((max_pkt_len != 0u)
       && (max_pkt_len != 8u)
       && (max_pkt_len != 16u)
       && (max_pkt_len != 32u)
       && (max_pkt_len != 64u))
      && (SL_IS_BIT_CLEAR(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true)) {
#else
  if ( (max_pkt_len != 0u)
       && (max_pkt_len != 8u)
       && (max_pkt_len != 16u)
       && (max_pkt_len != 32u)
       && (max_pkt_len != 64u)) {
#endif
    *p_ep_addr = SL_USBD_ENDPOINT_ADDR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  return usbd_core_add_endpoint(config_nbr,
                                if_nbr,
                                if_alt_nbr,
                                SL_USBD_ENDPOINT_TYPE_BULK,
                                dir_in,
                                max_pkt_len,
                                0u,
                                p_ep_addr);
}

/****************************************************************************************************//**
 * Adds an interrupt endpoint to an alternate setting interface
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_interrupt_endpoint(uint8_t    config_nbr,
                                                uint8_t    if_nbr,
                                                uint8_t    if_alt_nbr,
                                                bool       dir_in,
                                                uint16_t   max_pkt_len,
                                                uint16_t   interval,
                                                uint8_t    *p_ep_addr)
{
  uint8_t interval_code;

  if (p_ep_addr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (interval == 0u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

#if (USBD_CFG_HS_EN == 1)
  // Full spd validation.
  // SL_USBD_CONFIG_NBR_SPD_BIT will always be clear in FS.
  if (SL_IS_BIT_CLEAR(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true) {
#endif
  if (max_pkt_len > 64u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (interval < 255u) {
    interval_code = (uint8_t)interval;
  } else {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }
#if (USBD_CFG_HS_EN == 1)
} else {
  // High spd validation.
  if (((if_alt_nbr == 0u) && (max_pkt_len > 64u)) || (max_pkt_len > 1024u)) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // See Note #2.
  if (interval > SL_USBD_ENDPOINT_MAX_INTERVAL_VAL) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // interval must be a power of 2.
  if (SLI_USBD_IS_PWR2(interval) == false) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }
  // Compute bInterval exponent in 2^(bInterval-1).
  interval_code = (uint8_t)(32u - __CLZ(interval));

  if (interval_code > 16u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }
}
#endif

  return usbd_core_add_endpoint(config_nbr,
                                if_nbr,
                                if_alt_nbr,
                                SL_USBD_ENDPOINT_TYPE_INTR,
                                dir_in,
                                max_pkt_len,
                                interval_code,
                                p_ep_addr);
}

/****************************************************************************************************//**
 * Adds an isochronous endpoint to alternate setting interface
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_add_isochronous_endpoint(uint8_t    config_nbr,
                                                  uint8_t    if_nbr,
                                                  uint8_t    if_alt_nbr,
                                                  bool       dir_in,
                                                  uint8_t    attrib,
                                                  uint16_t   max_pkt_len,
                                                  uint8_t    transaction_frame,
                                                  uint16_t   interval,
                                                  uint8_t    *p_ep_addr)
{
  uint16_t pkt_len;
  uint8_t interval_code;

  if (p_ep_addr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  // Chk if dflt IF setting with isoc EP max_pkt_len > 0.
  if ((if_alt_nbr == 0u) && (max_pkt_len > 0u)) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk if sync & usage bits are used.
  if ((attrib & (uint8_t)(~(SL_USBD_ENDPOINT_TYPE_SYNC_MASK | SL_USBD_ENDPOINT_TYPE_USAGE_MASK))) != 0u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

#if (USBD_CFG_HS_EN == 1)
  // Full spd validation.
  // SL_USBD_CONFIG_NBR_SPD_BIT will always be clear in FS.
  if (SL_IS_BIT_CLEAR(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true) {
#endif
  if (max_pkt_len > 1023u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

