espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  if (transaction_frame != 1u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }
#if (USBD_CFG_HS_EN == 1)
} else {
  // High spd validation.
  switch (transaction_frame) {
    case 1u:
      if (max_pkt_len > 1024u) {
        *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case 2u:
      if ((max_pkt_len < 513u) || (max_pkt_len > 1024u)) {
        *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    case 3u:
      if ((max_pkt_len < 683u) || (max_pkt_len > 1024u)) {
        *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
        return SL_STATUS_INVALID_PARAMETER;
      }
      break;

    default:
      *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
      return SL_STATUS_INVALID_PARAMETER;
  }
}
#endif

  // Explicit feedback EP must be set to no sync.
  if (((attrib & SL_USBD_ENDPOINT_TYPE_USAGE_MASK) == SL_USBD_ENDPOINT_TYPE_USAGE_FEEDBACK)
      && ((attrib & SL_USBD_ENDPOINT_TYPE_SYNC_MASK) != SL_USBD_ENDPOINT_TYPE_SYNC_NONE)) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // See Note #3.
  if (interval > SL_USBD_ENDPOINT_MAX_INTERVAL_VAL) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // interval must be a power of 2.
  if (SLI_USBD_IS_PWR2(interval) == false) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Compute bInterval exponent in 2^(bInterval-1).
  interval_code = (uint8_t)(32u - __CLZ(interval));

  if (interval_code > 16u) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  pkt_len = (transaction_frame - 1u) << 11u | max_pkt_len;

  return usbd_core_add_endpoint(config_nbr,
                                if_nbr,
                                if_alt_nbr,
                                SL_USBD_ENDPOINT_TYPE_ISOC | attrib,
                                dir_in,
                                pkt_len,
                                interval_code,
                                p_ep_addr);
}
#endif

/****************************************************************************************************//**
 * Set synchronization feedback rate on synchronization isochronous endpoint
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_set_isochronous_endpoint_refresh_rate(uint8_t config_nbr,
                                                               uint8_t if_nbr,
                                                               uint8_t if_alt_nbr,
                                                               uint8_t synch_ep_addr,
                                                               uint8_t sync_refresh)
{
  sli_usbd_device_t     *p_dev;
  sli_usbd_configuration_t  *p_config;
  sli_usbd_interface_t      *p_if;
  sli_usbd_alt_interface_t  *p_if_alt;
  sli_usbd_endpoint_info_t *p_ep;
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  uint32_t ep_alloc_map;
#endif
  uint8_t  ep_nbr;
  bool found;
  CORE_DECLARE_IRQ_STATE;

  // See Note #3.
  if ((sync_refresh < 1u) || (sync_refresh > 9u)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get Object References

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE)
      && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    return SL_STATUS_INVALID_STATE;
  }

  // Get cfg struct.
  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);

  if (p_config == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get IF struct.
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);

  if (p_if == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk if audio class.
  if (p_if->class_code != SL_USBD_CLASS_CODE_AUDIO) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk if audio class, version 1.0.
  if (p_if->class_protocol_code != 0u) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get IF alt setting struct.
  p_if_alt = usbd_core_get_alt_interface_structure(p_if, if_alt_nbr);

  if (p_if_alt == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  found = false;
  p_ep = NULL;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  ep_alloc_map = p_if_alt->endpoint_table_map;
  while ((ep_alloc_map != 0x00u)
         && (found != true)) {
    ep_nbr = (uint8_t)__CLZ(__RBIT(ep_alloc_map));
    p_ep = p_if_alt->endpoint_table_ptrs[ep_nbr];

    if (p_ep->address == synch_ep_addr) {
      found = true;
    }

    SL_CLEAR_BIT(ep_alloc_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
  }
#else
  p_ep = p_if_alt->endpoint_head_ptr;

  for (ep_nbr = 0u; ep_nbr < p_if_alt->endpoint_nbr_total; ep_nbr++) {
    if (p_ep->address == synch_ep_addr) {
      found = true;
      break;
    }

    p_ep = p_ep->next_ptr;
  }
#endif

  if (found != true) {
    return SL_STATUS_INVALID_HANDLE;
  }
  // Chk EP type attrib.
  if ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) != SL_USBD_ENDPOINT_TYPE_ISOC) {
    return SL_STATUS_INVALID_HANDLE;
  }

  // Chk EP sync type attrib.
  switch (p_ep->attrib & SL_USBD_ENDPOINT_TYPE_SYNC_MASK) {
    case SL_USBD_ENDPOINT_TYPE_SYNC_NONE:
      break;

    case SL_USBD_ENDPOINT_TYPE_SYNC_ASYNC:
    case SL_USBD_ENDPOINT_TYPE_SYNC_ADAPTIVE:
    case SL_USBD_ENDPOINT_TYPE_SYNC_SYNC:
    default:
      return SL_STATUS_INVALID_HANDLE;
  }

  // Chk EP usage type attrib.
  switch (p_ep->attrib & SL_USBD_ENDPOINT_TYPE_USAGE_MASK) {
    case SL_USBD_ENDPOINT_TYPE_USAGE_FEEDBACK:
      // See Note #4.
      break;

    case SL_USBD_ENDPOINT_TYPE_USAGE_DATA:
    case SL_USBD_ENDPOINT_TYPE_USAGE_IMPLICIT_FEEDBACK:
    default:
      return SL_STATUS_INVALID_HANDLE;
  }

  // Chk associated sync EP addr.
  if (p_ep->sync_addr != 0u) {
    return SL_STATUS_INVALID_HANDLE;
  }

  CORE_ENTER_ATOMIC();
  p_ep->sync_refresh = sync_refresh;
  CORE_EXIT_ATOMIC();

