espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 * Associates synchronization endpoint to isochronous endpoint
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_set_isochronous_endpoint_sync_address(uint8_t config_nbr,
                                                               uint8_t if_nbr,
                                                               uint8_t if_alt_nbr,
                                                               uint8_t data_ep_addr,
                                                               uint8_t sync_addr)
{
  sli_usbd_device_t     *p_dev;
  sli_usbd_configuration_t  *p_config;
  sli_usbd_interface_t      *p_if;
  sli_usbd_alt_interface_t  *p_if_alt;
  sli_usbd_endpoint_info_t *p_ep;
  sli_usbd_endpoint_info_t *p_ep_isoc;
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  uint32_t ep_alloc_map;
#endif
  uint8_t  ep_nbr;
  bool found_ep;
  bool found_sync;
  CORE_DECLARE_IRQ_STATE;

  // Get Object References

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Chk curr dev state.
  if ((p_dev->state != SL_USBD_DEVICE_STATE_NONE)
      && (p_dev->state != SL_USBD_DEVICE_STATE_INIT)) {
    return SL_STATUS_INVALID_STATE;
  }

  // Get cfg struct.
  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);

  if (p_config == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get IF struct.
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);

  if (p_if == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk if audio class.
  if (p_if->class_code != SL_USBD_CLASS_CODE_AUDIO) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Chk if audio class, version 1.0.
  if (p_if->class_protocol_code != 0u) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get IF alt setting struct.
  p_if_alt = usbd_core_get_alt_interface_structure(p_if, if_alt_nbr);

  if (p_if_alt == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  found_ep = false;
  found_sync = false;
  p_ep_isoc = NULL;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  ep_alloc_map = p_if_alt->endpoint_table_map;
  while ((ep_alloc_map != 0x00u)
         && ((found_ep != true)
             || (found_sync != true))) {
    ep_nbr = (uint8_t)__CLZ(__RBIT(ep_alloc_map));
    p_ep = p_if_alt->endpoint_table_ptrs[ep_nbr];

    if (p_ep->address == data_ep_addr) {
      found_ep = true;
      p_ep_isoc = p_ep;
    }

    if (p_ep->address == sync_addr) {
      found_sync = true;
    }

    SL_CLEAR_BIT(ep_alloc_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
  }
#else
  p_ep = p_if_alt->endpoint_head_ptr;

  for (ep_nbr = 0u; ep_nbr < p_if_alt->endpoint_nbr_total; ep_nbr++) {
    if (p_ep->address == data_ep_addr) {
      found_ep = true;
      p_ep_isoc = p_ep;
    }

    if (p_ep->address == sync_addr) {
      found_sync = true;
    }

    if ((found_ep == true)
        && (found_sync == true)) {
      break;
    }

    p_ep = p_ep->next_ptr;
  }
#endif

  if (found_ep != true) {
    return SL_STATUS_INVALID_HANDLE;
  }

  if (found_sync != true) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  // Chk EP type attrib.
  if ((p_ep_isoc->attrib & SL_USBD_ENDPOINT_TYPE_MASK) != SL_USBD_ENDPOINT_TYPE_ISOC) {
    return SL_STATUS_INVALID_HANDLE;
  }

  // Chk EP sync type attrib.
  switch (p_ep_isoc->attrib & SL_USBD_ENDPOINT_TYPE_SYNC_MASK) {
    case SL_USBD_ENDPOINT_TYPE_SYNC_ASYNC:
      if (SL_USBD_ENDPOINT_IS_IN(p_ep_isoc->address) == true) {
        return SL_STATUS_INVALID_HANDLE;
      }
      break;

    case SL_USBD_ENDPOINT_TYPE_SYNC_ADAPTIVE:
      if (SL_USBD_ENDPOINT_IS_IN(p_ep_isoc->address) == false) {
        return SL_STATUS_INVALID_HANDLE;
      }
      break;

    case SL_USBD_ENDPOINT_TYPE_SYNC_NONE:
    case SL_USBD_ENDPOINT_TYPE_SYNC_SYNC:
    default:
      return SL_STATUS_INVALID_HANDLE;
  }

  // Chk EP usage type attrib.
  switch (p_ep_isoc->attrib & SL_USBD_ENDPOINT_TYPE_USAGE_MASK) {
    case SL_USBD_ENDPOINT_TYPE_USAGE_DATA:
      break;

    case SL_USBD_ENDPOINT_TYPE_USAGE_FEEDBACK:
    case SL_USBD_ENDPOINT_TYPE_USAGE_IMPLICIT_FEEDBACK:
    default:
      return SL_STATUS_INVALID_HANDLE;
  }

  // Refresh interval must be set to zero.
  if (p_ep_isoc->sync_refresh != 0u) {
    return SL_STATUS_INVALID_HANDLE;
  }

  CORE_ENTER_ATOMIC();
  p_ep_isoc->sync_addr = sync_addr;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 * Gets the maximum physical endpoint number
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_max_phy_endpoint_number(uint8_t *p_ep_phy_nbr)
{
  sli_usbd_device_t *p_dev;

  if (p_ep_phy_nbr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  if (p_dev->endpoint_max_phy_nbr == 0u) {
    *p_ep_phy_nbr = SL_USBD_ENDPOINT_PHY_NONE;
  } else {
    *p_ep_phy_nbr = p_dev->endpoint_max_phy_nbr - 1u;
  }

  return SL_STATUS_OK;
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                           INTERNAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 * Notifies the USB connection bus events to the device stack
 *******************************************************************************************************/
sl_status_t sli_usbd_core_connect_event(void)
{
  usbd_core_set_event(SLI_USBD_EVENT_BUS_CONNECT);
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Notifies the USB disconnection bus events to the device stack
 *******************************************************************************************************/
sl_status_t sli_usbd_core_disconnect_event(void)
{
  usbd_core_set_event(SLI_USBD_EVENT_BUS_DISCONNECT);
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Notifies the USB High-Speed bus events to the device stack
 *******************************************************************************************************/
sl_status_t sli_usbd_core_high_speed_event(void)
{
  usbd_core_set_event(SLI_USBD_EVENT_BUS_HS);
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Notifies the USB reset bus events to the device stack
 *******************************************************************************************************/
sl_status_t sli_usbd_core_reset_event(void)
{
  usbd_core_set_event(SLI_USBD_EVENT_BUS_RESET);
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Notifies the USB suspend bus events to the device stack
 *******************************************************************************************************/
sl_status_t sli_usbd_core_suspend_event(void)
{
  usbd_core_set_event(SLI_USBD_EVENT_BUS_SUSPEND);
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Notifies the USB resume bus events to the device stack
 *******************************************************************************************************/
sl_status_t sli_usbd_core_resume_event(void)
{
  usbd_core_set_event(SLI_USBD_EVENT_BUS_RESUME);
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sends a USB setup event to the core task
 *******************************************************************************************************/
sl_status_t sli_usbd_core_setup_event(void *p_buf)
{
  sli_usbd_device_t *p_dev;
  sli_usbd_core_event_t core_event;
  uint8_t *p_buf_08;

  // Get dev struct.
  p_dev = &usbd_ptr->device;

