espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  SLI_USBD_LOG_VRB(("USBD: Setup Pkt"));

  p_buf_08 = (uint8_t *)p_buf;
  p_dev->setup_req_next.bmRequestType = p_buf_08[0u];
  p_dev->setup_req_next.bRequest = p_buf_08[1u];
  memcpy(&p_dev->setup_req_next.wValue, (p_buf_08 + 2u), 2u);
  memcpy(&p_dev->setup_req_next.wIndex, (p_buf_08 + 4u), 2u);
  memcpy(&p_dev->setup_req_next.wLength, (p_buf_08 + 6u), 2u);

  core_event.type = SLI_USBD_EVENT_SETUP;

  sli_usbd_core_os_put_core_event(&core_event);

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sends a USB endpoint event to the core task
 *******************************************************************************************************/
sl_status_t sli_usbd_core_endpoint_event(uint8_t      ep_addr,
                                         sl_status_t  status)
{
  sli_usbd_core_event_t core_event;

  core_event.type = SLI_USBD_EVENT_ENDPOINT;
  core_event.endpoint_address = ep_addr;
  core_event.status = status;

  // Queue core event.
  sli_usbd_core_os_put_core_event(&core_event);

  return SL_STATUS_OK;
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                               usbd_core_add_device()
 *
 * @brief    Adds a device to the stack and creates the default control endpoints.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
static sl_status_t usbd_core_add_device(void)
{
  sli_usbd_device_t               *p_dev;
  uint8_t                         ep_phy_nbr;
  uint32_t                        ep_alloc_map;
  sli_usbd_endpoint_info_t        ep_info;
  bool                            alloc;
  sl_usbd_device_speed_t          drv_spd;
  sl_status_t                     status;

  sli_usbd_driver_get_speed(&drv_spd);

  // Initialize Device Structure
  p_dev = &usbd_ptr->device;
  p_dev->speed = drv_spd;

  // device configuration parameters from sl_usbd_device_config.h
  p_dev->device_config.product_id          = SL_USBD_DEVICE_PRODUCT_ID;
  p_dev->device_config.vendor_id           = SL_USBD_DEVICE_VENDOR_ID;
  p_dev->device_config.device_bcd          = SL_USBD_DEVICE_RELEASE_NUMBER;
  p_dev->device_config.manufacturer_str_ptr = SL_USBD_DEVICE_MANUFACTURER_STRING;
  p_dev->device_config.product_str_ptr      = SL_USBD_DEVICE_PRODUCT_STRING;
  p_dev->device_config.serial_nbr_str_ptr    = SL_USBD_DEVICE_SERIAL_NUMBER_STRING;
  p_dev->device_config.lang_id             = SL_USBD_DEVICE_LANGUAGE_ID;

  ep_alloc_map = 0x00u;

  // Alloc physical EP for ctrl OUT.
  usbd_core_allocate_endpoint(drv_spd,
                              SL_USBD_ENDPOINT_TYPE_CTRL,
                              false,
                              0u,
                              0u,
                              &ep_info,
                              &ep_alloc_map,
                              &alloc);

  if (alloc != true) {
    return SL_STATUS_NOT_AVAILABLE;
  }

  ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(ep_info.address);
  ep_phy_nbr++;

  if (p_dev->endpoint_max_phy_nbr < ep_phy_nbr) {
    p_dev->endpoint_max_phy_nbr = ep_phy_nbr;
  }

  // Alloc physical EP for ctrl IN.
  usbd_core_allocate_endpoint(drv_spd,
                              SL_USBD_ENDPOINT_TYPE_CTRL,
                              true,
                              0u,
                              0u,
                              &ep_info,
                              &ep_alloc_map,
                              &alloc);

  if (alloc != true) {
    return SL_STATUS_NOT_AVAILABLE;
  }

  p_dev->endpoint_max_ctrl_pkt_size = ep_info.max_pkt_size;

  ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(ep_info.address);
  ep_phy_nbr++;

  if (p_dev->endpoint_max_phy_nbr < ep_phy_nbr) {
    p_dev->endpoint_max_phy_nbr = ep_phy_nbr;
  }

#if (USBD_CFG_STR_EN == 1)
  // Add device configuration strings:

  // Manufacturer string.
  status = usbd_core_add_string(p_dev,
                                p_dev->device_config.manufacturer_str_ptr);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Product string.
  status = usbd_core_add_string(p_dev,
                                p_dev->device_config.product_str_ptr);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Serial number string.
  status = usbd_core_add_string(p_dev,
                                p_dev->device_config.serial_nbr_str_ptr);
  if (status != SL_STATUS_OK) {
    return status;
  }
#endif

  status = sli_usbd_core_os_create_task();

  return status;
}

/****************************************************************************************************//**
 *                                               usbd_core_add_endpoint()
 *
 * @brief    Add an endpoint to alternate setting interface.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    if_nbr          Interface number.
 *
 * @param    if_alt_nbr      Interface alternate setting number.
 *
 * @param    attrib          Endpoint's attributes.
 *
 * @param    dir_in          Endpoint Direction.
 *
 * @param    max_pkt_len     Endpoint maximum packet size.
 *
 * @param    interval        interval for polling data transfers.
 *
 * @param    p_ep_addr       Pointer to the variable that will receive endpoint address.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 *******************************************************************************************************/
static sl_status_t usbd_core_add_endpoint(uint8_t   config_nbr,
                                          uint8_t   if_nbr,
                                          uint8_t   if_alt_nbr,
                                          uint8_t   attrib,
                                          bool      dir_in,
                                          uint16_t  max_pkt_len,
                                          uint8_t   interval,
                                          uint8_t   *p_ep_addr)

{
  sli_usbd_device_t     *p_dev;
  sli_usbd_configuration_t  *p_config;
  sli_usbd_interface_t      *p_if;
  sli_usbd_alt_interface_t  *p_if_alt;
  sli_usbd_endpoint_info_t *p_ep;
  uint8_t   ep_type;
  uint32_t   ep_alloc_map;
  uint32_t   ep_alloc_map_clr;
  uint8_t   ep_nbr;
  uint8_t   ep_phy_nbr;
  sl_usbd_device_speed_t dev_spd;
  bool  alloc;
  CORE_DECLARE_IRQ_STATE;

  // Get Object References

  // Get dev struct.
  p_dev = &usbd_ptr->device;

  // Get cfg struct.
  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);

  if (p_config == NULL) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get IF struct.
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);

  if (p_if == NULL) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get IF alt setting struct.
  p_if_alt = usbd_core_get_alt_interface_structure(p_if, if_alt_nbr);

  if (p_if_alt == NULL) {
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

