espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  CORE_ENTER_ATOMIC();
  // Chk if EP is avail.
  if (usbd_ptr->endpoint_info_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }
  usbd_ptr->endpoint_info_nbr_next--;
  ep_nbr = usbd_ptr->endpoint_info_nbr_next;
  CORE_EXIT_ATOMIC();

  ep_type = attrib & SL_USBD_ENDPOINT_TYPE_MASK;
#if (USBD_CFG_HS_EN == 1)
  if (SL_IS_BIT_SET(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true) {
    dev_spd = SL_USBD_DEVICE_SPEED_HIGH;
  } else {
#endif
  dev_spd = SL_USBD_DEVICE_SPEED_FULL;
#if (USBD_CFG_HS_EN == 1)
}
#endif

  p_ep = &usbd_ptr->endpoint_info_table[ep_nbr];
  p_ep->interval = interval;
  p_ep->attrib = attrib;
  // Default sync addr is zero.
  p_ep->sync_addr = 0u;
  // Default feedback rate exponent is zero.
  p_ep->sync_refresh = 0u;

  CORE_ENTER_ATOMIC();
  // Get cfg EP alloc bit map.
  ep_alloc_map = p_config->endpoint_alloc_map;
  // Clr EP already alloc'd in the IF.
  ep_alloc_map &= ~p_if->endpoint_alloc_map;
  ep_alloc_map |= p_if_alt->endpoint_alloc_map;

  ep_alloc_map_clr = ep_alloc_map;

  // Alloc physical EP.
  usbd_core_allocate_endpoint(dev_spd,
                              ep_type,
                              dir_in,
                              // Mask out transactions per microframe.
                              max_pkt_len & 0x7FF,
                              if_alt_nbr,
                              p_ep,
                              &ep_alloc_map,
                              &alloc);

  if (alloc != true) {
    CORE_EXIT_ATOMIC();
    *p_ep_addr = SL_USBD_ENDPOINT_NBR_NONE;
    return SL_STATUS_NOT_AVAILABLE;
  }

  // Set transactions per microframe.
  p_ep->max_pkt_size |= max_pkt_len & 0x1800;

  ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(p_ep->address);
  ep_phy_nbr++;

  if (p_dev->endpoint_max_phy_nbr < ep_phy_nbr) {
    p_dev->endpoint_max_phy_nbr = ep_phy_nbr;
  }

  p_if_alt->endpoint_alloc_map |= ep_alloc_map & ~ep_alloc_map_clr;
  p_if->endpoint_alloc_map |= p_if_alt->endpoint_alloc_map;
  p_config->endpoint_alloc_map |= p_if->endpoint_alloc_map;

  p_if_alt->endpoint_nbr_total++;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  ep_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(p_ep->address);
  p_if_alt->endpoint_table_ptrs[ep_nbr] = p_ep;
  SL_SET_BIT(p_if_alt->endpoint_table_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
#else
  p_ep->next_ptr = NULL;
  if (p_if_alt->endpoint_head_ptr == NULL) {
    p_if_alt->endpoint_head_ptr = p_ep;
    p_if_alt->endpoint_tail_ptr = p_ep;
  } else {
    p_if_alt->endpoint_tail_ptr->next_ptr = p_ep;
    p_if_alt->endpoint_tail_ptr = p_ep;
  }
#endif
  CORE_EXIT_ATOMIC();

  *p_ep_addr = p_ep->address;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 *                                               usbd_core_allocate_endpoint()
 *
 * @brief    Allocate a physical endpoint from the device controller.
 *
 * @param    spd                 Endpoint speed.
 *                                   - SL_USBD_DEVICE_SPEED_FULL   Endpoint is full-speed.
 *                                   - SL_USBD_DEVICE_SPEED_HIGH   Endpoint is high-speed.
 *
 * @param    type                Endpoint type.
 *                                   - SL_USBD_ENDPOINT_TYPE_CTRL  Control endpoint.
 *                                   - SL_USBD_ENDPOINT_TYPE_ISOC  Isochronous endpoint.
 *                                   - SL_USBD_ENDPOINT_TYPE_BULK  Bulk endpoint.
 *                                   - SL_USBD_ENDPOINT_TYPE_INTR  Interrupt endpoint.
 *
 * @param    dir_in              Endpoint direction.
 *                                   - true    IN  endpoint.
 *                                   - false   OUT endpoint.
 *
 * @param    max_pkt_len         Endpoint maximum packet size length.
 *
 * @param    if_alt_nbr          Alternate interface number containing the endpoint.
 *
 * @param    p_ep                Pointer to the variable that will receive the endpoint parameters.
 *
 * @param    ----                Argument validated in 'sl_usbd_core_add_device()' & 'usbd_core_add_endpoint()'
 *
 * @param    p_alloc_bit_map     Pointer to allocation table bit-map.
 *
 * @param    ---------------     Argument validated in 'sl_usbd_core_add_device()' & 'usbd_core_add_endpoint()'
 *
 * @param    p_alloc             Pointer to a boolean where function result will be returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) 'Universal Serial Bus Specification, Revision 2.0, April 27, 2000' Section 5.5.3
 *               @n
 *               "An endpoint for control transfers specifies the maximum data payload size that
 *               the endpoint can accept from or transmit to the bus. The allowable maximum control
 *               transfer data payload sizes for full-speed devices is 8, 16, 32, or 64 bytes; for
 *               high-speed devices, it is 64 bytes and for low-speed devices, it is 8 bytes."
 *               @n
 *               "All Host Controllers are required to have support for 8-, 16-, 32-, and 64-byte
 *               maximum data payload sizes for full-speed control endpoints, only 8-byte maximum
 *               data payload sizes for low-speed control endpoints, and only 64-byte maximum data
 *               payload size for high-speed control endpoints"
 *******************************************************************************************************/
static sl_status_t usbd_core_allocate_endpoint(sl_usbd_device_speed_t   spd,
                                               uint8_t                  type,
                                               bool                     dir_in,
                                               uint16_t                 max_pkt_len,
                                               uint8_t                  if_alt_nbr,
                                               sli_usbd_endpoint_info_t *p_ep,
                                               uint32_t                 *p_alloc_bit_map,
                                               bool                     *p_alloc)
{
  sli_usbd_driver_endpoint_info_t *p_ep_tbl;
  uint8_t       ep_tbl_ix;
  uint8_t       ep_attrib;
  uint8_t       ep_attrib_srch;
  uint8_t       ep_max_pkt_bits;
  uint16_t       ep_max_pkt;
  bool      ep_found;

