espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
#if (USBD_CFG_HS_EN == 0)
  (void)&spd;
  (void)&if_alt_nbr;
#endif

  if (dir_in == true) {
    ep_attrib_srch = SL_USBD_ENDPOINT_INFO_DIR_IN;
  } else {
    ep_attrib_srch = SL_USBD_ENDPOINT_INFO_DIR_OUT;
  }

  switch (type) {
    case SL_USBD_ENDPOINT_TYPE_CTRL:
      SL_SET_BIT(ep_attrib_srch, SL_USBD_ENDPOINT_INFO_TYPE_CTRL);
      break;

    case SL_USBD_ENDPOINT_TYPE_ISOC:
      SL_SET_BIT(ep_attrib_srch, SL_USBD_ENDPOINT_INFO_TYPE_ISOC);
      break;

    case SL_USBD_ENDPOINT_TYPE_BULK:
      SL_SET_BIT(ep_attrib_srch, SL_USBD_ENDPOINT_INFO_TYPE_BULK);
      break;

    case SL_USBD_ENDPOINT_TYPE_INTR:
      SL_SET_BIT(ep_attrib_srch, SL_USBD_ENDPOINT_INFO_TYPE_INTR);
      break;

    default:
      *p_alloc = false;
      return SL_STATUS_OK;
  }

  // Get ctrl EP info tbl.
  sli_usbd_driver_get_endpoint_info(&p_ep_tbl);
  // Get attrib for first entry.
  ep_attrib = p_ep_tbl->attrib;
  ep_tbl_ix = 0u;
  ep_found = false;

  // Search until last entry or EP found.
  while ((ep_attrib != 0x00u)
         && (ep_found == false)) {
    // Chk if EP not alloc'd and EP attrib match req'd attrib.
    if ((SL_IS_BIT_CLEAR(*p_alloc_bit_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_tbl_ix)) == true)
        && (SL_IS_BIT_SET(ep_attrib, ep_attrib_srch) == true)) {
      ep_max_pkt = p_ep_tbl[ep_tbl_ix].max_pkt_size;

      switch (type) {
        // Chk ctrl transfer pkt size constrains.
        case SL_USBD_ENDPOINT_TYPE_CTRL:
          ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 64u);
          // Get next power of 2.
          ep_max_pkt_bits = (uint8_t)(31u - __CLZ(ep_max_pkt));
          ep_max_pkt = SLI_USBD_SINGLE_BIT_MASK_16(ep_max_pkt_bits);
#if (USBD_CFG_HS_EN == 1)
          if ((spd == SL_USBD_DEVICE_SPEED_HIGH)
              && (ep_max_pkt != 64u)) {
            break;
          }

          if ((spd == SL_USBD_DEVICE_SPEED_HIGH)
              && (ep_max_pkt < 8u)) {
            break;
          }
#endif
          ep_found = true;
          break;

        case SL_USBD_ENDPOINT_TYPE_BULK:
#if (USBD_CFG_HS_EN == 1)
          // Max pkt size is 512 for bulk EP in HS.
          ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 512u);
          if ((spd == SL_USBD_DEVICE_SPEED_HIGH)
              && (ep_max_pkt == 512u)) {
            ep_found = true;
            break;
          }
#endif
          // Max pkt size is 64 for bulk EP in FS.
          ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 64u);
          ep_max_pkt_bits = (uint8_t)(31u - __CLZ(ep_max_pkt));
          ep_max_pkt = SLI_USBD_SINGLE_BIT_MASK_16(ep_max_pkt_bits);
#if (USBD_CFG_HS_EN == 1)
          if ((spd == SL_USBD_DEVICE_SPEED_HIGH)
              && (ep_max_pkt >= 8u)) {
            break;
          }
#endif
          ep_found = true;
          break;

        case SL_USBD_ENDPOINT_TYPE_ISOC:
#if (USBD_CFG_HS_EN == 1)
          if (spd == SL_USBD_DEVICE_SPEED_HIGH) {
            ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 1024u);
          } else {
#endif
          ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 1023u);
#if (USBD_CFG_HS_EN == 1)
      }
#endif

          if (max_pkt_len > 0u) {
            ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, max_pkt_len);
          }

          ep_found = true;
          break;

        case SL_USBD_ENDPOINT_TYPE_INTR:
#if (USBD_CFG_HS_EN == 1)
          if ((spd == SL_USBD_DEVICE_SPEED_HIGH)
              && (if_alt_nbr != 0u)) {
            // Dflt IF intr EP max pkt size limited to 64.
            ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 1024u);
          } else {
#endif
          ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, 64u);
#if (USBD_CFG_HS_EN == 1)
      }
#endif
          if (max_pkt_len > 0u) {
            ep_max_pkt = SLI_USBD_GET_MIN(ep_max_pkt, max_pkt_len);
          }

          ep_found = true;
          break;

        default:
          *p_alloc = false;
          return SL_STATUS_OK;
      }

      if ((ep_found == true)
          && ((max_pkt_len == ep_max_pkt)
              || (max_pkt_len == 0u))) {
        p_ep->max_pkt_size = ep_max_pkt;
        SL_SET_BIT(*p_alloc_bit_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_tbl_ix));
        p_ep->address = p_ep_tbl[ep_tbl_ix].nbr;
        if (dir_in == true) {
          // Add dir bit (IN EP).
          p_ep->address |= SL_USBD_ENDPOINT_DIR_IN;
        }
      } else {
        ep_found = false;
        ep_tbl_ix++;
        ep_attrib = p_ep_tbl[ep_tbl_ix].attrib;
      }
    } else {
      ep_tbl_ix++;
      ep_attrib = p_ep_tbl[ep_tbl_ix].attrib;
    }
  }

  if (ep_found == false) {
    *p_alloc = false;
    return SL_STATUS_OK;
  }

  *p_alloc = true;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 *                                           usbd_core_stdreq_handler()
 *
 * @brief    Standard request process.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----  Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *******************************************************************************************************/
static void usbd_core_stdreq_handler(sli_usbd_device_t *p_dev)
{
  uint8_t recipient;
  uint8_t type;
  uint8_t request;
  bool valid;
  bool dev_to_host;
  sl_status_t   local_status;
  CORE_DECLARE_IRQ_STATE;

  local_status = SL_STATUS_OK;

#if (USBD_CFG_MS_OS_DESC_EN != 1)
  (void)&local_status;
#endif

  CORE_ENTER_ATOMIC();
  // Copy setup request.
  p_dev->setup_req.bmRequestType = p_dev->setup_req_next.bmRequestType;
  p_dev->setup_req.bRequest = p_dev->setup_req_next.bRequest;
  p_dev->setup_req.wValue = p_dev->setup_req_next.wValue;
  p_dev->setup_req.wIndex = p_dev->setup_req_next.wIndex;
  p_dev->setup_req.wLength = p_dev->setup_req_next.wLength;
  CORE_EXIT_ATOMIC();

  recipient = p_dev->setup_req.bmRequestType & SL_USBD_REQ_RECIPIENT_MASK;
  type = p_dev->setup_req.bmRequestType & SL_USBD_REQ_TYPE_MASK;
  request = p_dev->setup_req.bRequest;
  dev_to_host = SL_IS_BIT_SET(p_dev->setup_req.bmRequestType, SL_USBD_REQ_DIR_BIT);
  valid = false;

  switch (type) {
    case SL_USBD_REQ_TYPE_STANDARD:
      // Select req recipient:
      switch (recipient) {
        case SL_USBD_REQ_RECIPIENT_DEVICE:
          // Device.
          valid = usbd_core_device_stdreq(p_dev, request);
          break;

        case SL_USBD_REQ_RECIPIENT_INTERFACE:
          // Interface.
          valid = usbd_core_interface_stdreq(p_dev, request);
          break;

        case SL_USBD_REQ_RECIPIENT_ENDPOINT:
          // Endpoint.
          valid = usbd_core_endpoint_stdreq(p_dev, request);
          break;

