espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
        case SL_USBD_REQ_RECIPIENT_OTHER:
        // Not supported.
        default:
          break;
      }
      break;

    case SL_USBD_REQ_TYPE_CLASS:
      // Class-specific req.
      switch (recipient) {
        case SL_USBD_REQ_RECIPIENT_INTERFACE:
        case SL_USBD_REQ_RECIPIENT_ENDPOINT:
          // Class-specific req.
          valid = usbd_core_class_stdreq(p_dev);
          break;

        case SL_USBD_REQ_RECIPIENT_DEVICE:
        case SL_USBD_REQ_RECIPIENT_OTHER:
        default:
          break;
      }
      break;

    case SL_USBD_REQ_TYPE_VENDOR:
      switch (recipient) {
        case SL_USBD_REQ_RECIPIENT_INTERFACE:
#if (USBD_CFG_MS_OS_DESC_EN == 1)
          if (request == p_dev->str_microsoft_vendor_code) {
            p_dev->desc_buf_status_ptr = &local_status;
            // Microsoft OS descriptor req.
            valid = usbd_core_microsoft_interface_stdreq(p_dev);
            p_dev->desc_buf_status_ptr = NULL;
          } else {
            // Vendor-specific req.
            valid = usbd_core_vendor_stdreq(p_dev);
          }
          break;
#endif

        case SL_USBD_REQ_RECIPIENT_ENDPOINT:
          // Vendor-specific req.
          valid = usbd_core_vendor_stdreq(p_dev);
          break;

        case SL_USBD_REQ_RECIPIENT_DEVICE:
#if (USBD_CFG_MS_OS_DESC_EN == 1)
          if (request == p_dev->str_microsoft_vendor_code) {
            p_dev->desc_buf_status_ptr = &local_status;
            // Microsoft OS descriptor req.
            valid = usbd_core_microsoft_device_stdreq(p_dev);
            p_dev->desc_buf_status_ptr = NULL;
          }
#endif
          break;

        case SL_USBD_REQ_RECIPIENT_OTHER:
        default:
          break;
      }
      break;

    case SL_USBD_REQ_TYPE_RESERVED:
    default:
      break;
  }

  if (valid == false) {
    SLI_USBD_LOG_DBG(("USBD: Request Error"));
    sli_usbd_core_stall_control_endpoint();
  } else {
    uint32_t std_req_timeout;

    CORE_ENTER_ATOMIC();
    std_req_timeout = usbd_ptr->std_req_timeout_ms;
    CORE_EXIT_ATOMIC();

    if (dev_to_host == true) {
      SLI_USBD_LOG_VRB(("USBD: Rx Status"));
      sli_usbd_core_get_control_rx_status(std_req_timeout);
    } else {
      SLI_USBD_LOG_VRB(("USBD: Tx Status"));
      sli_usbd_core_get_control_tx_status(std_req_timeout);
    }
  }
}

/****************************************************************************************************//**
 *                                               usbd_core_device_stdreq()
 *
 * @brief    Process device standard request.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----    Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    request     USB device request.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *
 * @note     (1) USB Spec 2.0, section 9.4.6 specifies the format of the SET_ADDRESS request. The
 *               SET_ADDRESS sets the device address for all future device access.
 *           - (a) The 'wValue' filed specify the device address to use for all subsequent accesses.
 *           - (b) If the specified device address is greater than 127 or if 'wIndex' or 'wLength'
 *                   are non-zero, the behavior of the device is not specified.
 *           - (c) If the device is in the default state and the address specified is non-zero,
 *                   the device shall enter the device address, otherwise the device remains in the
 *                   default state' (this is not an error condition).
 *           - (d) If the device is in the address state and the address specified is zero, then
 *                   the device shall enter the default state otherwise, the device remains in
 *                   the address state but uses the newly-specified address.
 *           - (e) Device behavior when the SET_ADDRESS request is received while the device is not
 *                   in the default or address state is not specified.
 *           - (f) USB Spec 2.0, section 9.2.6.3 specifies the maximum timeout for the SET_ADDRESS
 *                   request:
 *                   "After the reset/resume recovery interval, if a device receives a SetAddress()
 *                   request, the device must be able to complete processing of the request and be
 *                   able to successfully complete the Status stage of the request within 50 ms. In
 *                   the case of the SetAddress() request, the Status stage successfully completes
 *                   when the device sends the zero-length Status packet or when the device sees
 *                   the ACK in response to the Status stage data packet."
 *
 * @note     (2) USB Spec 2.0, section 9.4.7 specifies the format of the SET_CONFIGURATION request.
 *           - (a) The lower byte of 'wValue' field specifies the desired configuration.
 *           - (b) If 'wIndex', 'wLength', or the upper byte of wValue is non-zero, then the behavior
 *                   of this request is not specified.
 *           - (c) The configuration value must be zero or match a configuration value from a
 *                   configuration value from a configuration descriptor. If the configuration value
 *                   is zero, the device is place in its address state.
 *           - (d) Device behavior when this request is received while the device is in the Default
 *                   state is not specified.
 *           - (e) If device is in address state and the specified configuration value is zero,
 *                   then the device remains in the Address state. If the specified configuration value
 *                   matches the configuration value from a configuration descriptor, then that
 *                   configuration is selected and the device enters the Configured state. Otherwise,
 *                   the device responds with a Request Error.
 *           - (f) If the specified configuration value is zero, then the device enters the Address
 *                   state. If the specified configuration value matches the configuration value from a
 *                   configuration descriptor, then that configuration is selected and the device
 *                   remains in the Configured state. Otherwise, the device responds with a Request
 *                   Error.
 *
 * @note     (3) USB Spec 2.0, section 9.4.2 specifies the format of the GET_CONFIGURATION request.
 *           - (a) If 'wValue' or 'wIndex' are non-zero or 'wLength' is not '1', then the device
 *                   behavior is not specified.
 *           - (b) If the device is in default state, the device behavior is not specified.
 *           - (c) In address state a value of zero MUST be returned.
 *           - (d) In configured state, the non-zero bConfigurationValue of the current configuration
 *                   must be returned.
 *
 * @note     (4) USB Spec 2.0, section 9.4.5 specifies the format of the GET_STATUS request.
 *           - (a) If 'wValue' is non-zero or 'wLength is not equal to '2', or if wIndex is non-zero
 *                   then the behavior of the device is not specified.
 *           - (b) USB Spec 2, 0, figure 9-4 shows the format of information returned by the device
 *                   for a GET_STATUS request.
 *                   @verbatim
 *                   +====|====|====|====|====|====|====|========|=========+
 *                   | D0 | D1 | D2 | D3 | D4 | D3 | D2 |   D1   |    D0   |
 *                   |----------------------------------|--------|---------|
 *                   |     RESERVED (RESET TO ZERO)     | Remote |   Self  |
 *                   |                                  | Wakeup | Powered |
 *                   +==================================|========|=========+
 *                   @endverbatim
 *               - (1) The Self Powered field indicates whether the device is currently self-powered.
 *                       If D0 is reset to zero, the device is bus-powered. If D0 is set to one, the
 *                       device is self-powered. The Self Powered field may not be changed by the
 *                       SetFeature() or ClearFeature() requests.
 *               - (2) The Remote Wakeup field indicates whether the device is currently enabled to
 *                       request remote wakeup. The default mode for devices that support remote wakeup
 *                       is disabled. If D1 is reset to zero, the ability of the device to signal
 *                       remote wakeup is disabled. If D1 is set to one, the ability of the device to
 *                       signal remote wakeup is enabled. The Remote Wakeup field can be modified by
 *                       the SetFeature() and ClearFeature() requests using the DEVICE_REMOTE_WAKEUP
 *                       feature selector. This field is reset to zero when the device is reset.
 *
 * @note     (5) USB Spec 2.0, section 9.4.1/9.4.9 specifies the format of the CLEAR_FEATURE/SET_FEATURE
 *               request.
 *           - (a) If 'wLength' or 'wIndex' are non-zero, then the device behavior is not specified.
 *           - (b) The device CLEAR_FEATURE request is only valid when the device is in the
 *                   configured state.
 *******************************************************************************************************/
static bool usbd_core_device_stdreq(sli_usbd_device_t   *p_dev,
                                    uint8_t             request)
{
  bool valid;
  bool dev_to_host;
  uint8_t dev_addr;
  uint8_t cfg_nbr;
  uint32_t std_req_timeout;
  uint32_t xfer_len;
  sl_status_t status;
  CORE_DECLARE_IRQ_STATE;

