espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  CORE_ENTER_ATOMIC();
  std_req_timeout = usbd_ptr->std_req_timeout_ms;
  CORE_EXIT_ATOMIC();

  SLI_USBD_DBG_STATS_DEV_INC(std_req_device_nbr);

  dev_to_host = SL_IS_BIT_SET(p_dev->setup_req.bmRequestType, SL_USBD_REQ_DIR_BIT);
  valid = false;

  switch (request) {
    case SL_USBD_REQ_GET_DESCRIPTOR:
      if (dev_to_host != true) {
        break;
      }

      valid = usbd_core_get_descriptor_stdreq(p_dev);
      break;

    case SL_USBD_REQ_SET_ADDRESS:
      if (dev_to_host != false) {
        break;
      }

      SLI_USBD_DBG_STATS_DEV_INC(std_req_set_address_nbr);

      // Get dev addr (see Note #1a).
      dev_addr = (uint8_t)(p_dev->setup_req.wValue
                           & 0xFFu);

      SLI_USBD_LOG_VRB(("USBD: Set Address to addr #", (u)dev_addr));

      // Validate request values. (see Note #1b).
      if ((dev_addr > 127u)
          || (p_dev->setup_req.wIndex != 0u)
          || (p_dev->setup_req.wLength != 0u)) {
        break;
      }

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_DEFAULT:
          if (dev_addr > 0u) {
            // See Note #1c.
            status = sli_usbd_driver_set_address(dev_addr);
            if (status != SL_STATUS_OK) {
              SLI_USBD_LOG_ERR(("USBD Set Address Failed"));
              break;
            }

            CORE_ENTER_ATOMIC();
            // Set dev in addressed state.
            p_dev->address = dev_addr;
            p_dev->state = SL_USBD_DEVICE_STATE_ADDRESSED;
            CORE_EXIT_ATOMIC();

            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_ADDRESSED:
          if (dev_addr == 0u) {
            // See Note #1c. If dev addr is zero set addr in dev drv.
            status = sli_usbd_driver_set_address(0u);
            if (status != SL_STATUS_OK) {
              SLI_USBD_LOG_ERR(("USBD Set Address Failed"));
              break;
            }

            CORE_ENTER_ATOMIC();
            // Dev enters default state.
            p_dev->address = 0u;
            p_dev->state = SL_USBD_DEVICE_STATE_DEFAULT;
            CORE_EXIT_ATOMIC();

            valid = true;
          } else {
            // remains in addressed state and set new addr.
            status = sli_usbd_driver_set_address(dev_addr);
            if (status != SL_STATUS_OK) {
              SLI_USBD_LOG_ERR(("USBD Set Address Failed"));
              break;
            }

            CORE_ENTER_ATOMIC();
            p_dev->address = dev_addr;
            CORE_EXIT_ATOMIC();

            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_CONFIGURED:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          SLI_USBD_LOG_ERR(("USBD Set Address Failed due to invalid device state."));
          break;
      }
      break;

    case SL_USBD_REQ_SET_CONFIGURATION:
      if (dev_to_host != false) {
        break;
      }

      SLI_USBD_DBG_STATS_DEV_INC(std_req_set_configuration_nbr);

      // Validate request values (see Note #2b).
      if (((p_dev->setup_req.wValue & 0xFF00u) != 0u)
          && (p_dev->setup_req.wIndex != 0u)
          && (p_dev->setup_req.wLength != 0u)) {
        break;
      }
      // Get cfg value.
      cfg_nbr = (uint8_t)(p_dev->setup_req.wValue & 0xFFu);
      SLI_USBD_LOG_VRB(("USBD: Set Configuration #", (u)cfg_nbr));

#if (USBD_CFG_HS_EN == 1)
      // Cfg value MUST exists.
      if ((cfg_nbr > p_dev->config_hs_total_nbr)
          && (p_dev->speed == SL_USBD_DEVICE_SPEED_HIGH)) {
        SLI_USBD_LOG_ERR(("  Set Configuration Cfg Invalid nbr"));
        break;
      }
#endif

      if ((cfg_nbr > p_dev->config_fs_total_nbr)
          && (p_dev->speed == SL_USBD_DEVICE_SPEED_FULL)) {
        SLI_USBD_LOG_ERR(("  Set Configuration Cfg Invalid nbr"));
        break;
      }

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_ADDRESSED:
          // See Note #2e.
          if (cfg_nbr > 0u) {
            // Open cfg.
            status = usbd_core_set_configuration(p_dev, (cfg_nbr - 1u));

            if (status != SL_STATUS_OK) {
              SLI_USBD_LOG_ERR(("USBD Set Configuration Failed. status = ", status));
              break;
            }

            valid = true;
          } else {
            // Remain in addressed state.
            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_CONFIGURED:
          // See Note #2f.
          if (cfg_nbr > 0u) {
            if (p_dev->config_cur_nbr == (cfg_nbr - 1u)) {
              valid = true;
              break;
            }

            // Close curr  cfg.
            usbd_core_unset_configuration(p_dev);

            // Open cfg.
            status = usbd_core_set_configuration(p_dev, (cfg_nbr - 1u));

            if (status != SL_STATUS_OK) {
              SLI_USBD_LOG_ERR(("USBD Set Configuration Failed. status = ", status));
              break;
            }

            valid = true;
          } else {
            // Close curr cfg.
            usbd_core_unset_configuration(p_dev);

            CORE_ENTER_ATOMIC();
            p_dev->state = SL_USBD_DEVICE_STATE_ADDRESSED;
            CORE_EXIT_ATOMIC();

            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_DEFAULT:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          SLI_USBD_LOG_ERR(("USBD Set Configuration Failed due to invalid device state."));
          break;
      }
      break;

    case SL_USBD_REQ_GET_CONFIGURATION:
      if (dev_to_host != true) {
        break;
      }

      // Validate request values (see Note #3a).
      if ((p_dev->setup_req.wLength != 1u)
          && (p_dev->setup_req.wIndex != 0u)
          && (p_dev->setup_req.wValue != 0u)) {
        break;
      }

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_ADDRESSED:
          // See Note #3b.
          cfg_nbr = 0u;
          SLI_USBD_LOG_VRB(("USBD: Get Configuration #", (u)cfg_nbr));

          // Uses Ctrl status buf to follow USB mem alignment.
          p_dev->ctrl_status_buf_ptr[0u] = cfg_nbr;

