espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
          status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                                   1u,
                                                   std_req_timeout,
                                                   false,
                                                   &xfer_len);
          if (status != SL_STATUS_OK) {
            break;
          }

          valid = true;
          break;

        case SL_USBD_DEVICE_STATE_CONFIGURED:
          // See Note #3c.
          if (p_dev->config_cur_ptr == NULL) {
            break;
          }

          cfg_nbr = p_dev->config_cur_nbr + 1u;
          SLI_USBD_LOG_VRB(("USBD: Get Configuration #", (u)cfg_nbr));

          // Uses Ctrl status buf to follow USB mem alignment.
          p_dev->ctrl_status_buf_ptr[0u] = cfg_nbr;

          status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                                   1u,
                                                   std_req_timeout,
                                                   false,
                                                   &xfer_len);
          if (status != SL_STATUS_OK) {
            break;
          }

          valid = true;
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_DEFAULT:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          SLI_USBD_LOG_ERR(("USBD Get Configuration Failed due to invalid device state."));
          break;
      }
      break;

    case SL_USBD_REQ_GET_STATUS:
      if (dev_to_host != true) {
        break;
      }

      // Validate request values (see Note #4a).
      if ((p_dev->setup_req.wLength != 2u)
          && (p_dev->setup_req.wIndex != 0u)
          && (p_dev->setup_req.wValue != 0u)) {
        break;
      }

      SLI_USBD_LOG_VRB(("USBD: Get Status (Device)"));
      p_dev->ctrl_status_buf_ptr[0u] = 0x00u;
      p_dev->ctrl_status_buf_ptr[1u] = 0x00u;

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_ADDRESSED:
          // See Note #4b.
          if (p_dev->self_power == true) {
            p_dev->ctrl_status_buf_ptr[0u] |= 0x01u; // BIT_00
          }
          if (p_dev->remote_wakeup == true) {
            p_dev->ctrl_status_buf_ptr[0u] |= 0x02u; // BIT_01
          }

          status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                                   2u,
                                                   std_req_timeout,
                                                   false,
                                                   &xfer_len);
          if (status != SL_STATUS_OK) {
            break;
          }

          valid = true;
          break;

        case SL_USBD_DEVICE_STATE_CONFIGURED:
          if (p_dev->config_cur_ptr != NULL) {
            if (SL_IS_BIT_SET(p_dev->config_cur_ptr->attrib, SL_USBD_DEV_ATTRIB_SELF_POWERED)) {
              p_dev->ctrl_status_buf_ptr[0u] |= 0x01u; // BIT_00
            }
            if (SL_IS_BIT_SET(p_dev->config_cur_ptr->attrib, SL_USBD_DEV_ATTRIB_REMOTE_WAKEUP)) {
              p_dev->ctrl_status_buf_ptr[0u] |= 0x02u; // BIT_01
            }
          }

          status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                                   2u,
                                                   std_req_timeout,
                                                   false,
                                                   &xfer_len);
          if (status != SL_STATUS_OK) {
            break;
          }

          valid = true;
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_DEFAULT:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          SLI_USBD_LOG_ERR(("USBD Get Status (Device) Failed due to invalid device state."));
          break;
      }
      break;

    case SL_USBD_REQ_CLEAR_FEATURE:
    case SL_USBD_REQ_SET_FEATURE:
      if (dev_to_host != false) {
        break;
      }

      // Validate request values.
      if ((p_dev->setup_req.wLength != 0u)
          && (p_dev->setup_req.wIndex != 0u)) {
        break;
      }

      if (request == SL_USBD_REQ_CLEAR_FEATURE) {
        SLI_USBD_LOG_VRB(("USBD: Clear Feature (Device)"));
      } else {
        SLI_USBD_LOG_VRB(("USBD: Set Feature (Device)"));
      }

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_CONFIGURED:
          if (p_dev->config_cur_ptr == NULL) {
            break;
          }

          if ((p_dev->setup_req.wValue == SL_USBD_FEATURE_SEL_DEVICE_REMOTE_WAKEUP)
              && (SL_IS_BIT_SET(p_dev->config_cur_ptr->attrib, SL_USBD_DEV_ATTRIB_REMOTE_WAKEUP))) {
            p_dev->remote_wakeup = (request == SL_USBD_REQ_CLEAR_FEATURE) ? 0u : 1u;
          }

          valid = true;
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_DEFAULT:
        case SL_USBD_DEVICE_STATE_ADDRESSED:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          if (request == SL_USBD_REQ_CLEAR_FEATURE) {
            SLI_USBD_LOG_ERR(("USBD Clear Feature (Device) Failed due to invalid device state."));
          } else {
            SLI_USBD_LOG_ERR(("USBD Set Feature (Device) Failed due to invalid device state."));
          }
          break;
      }
      break;

    default:
      break;
  }

  SLI_USBD_DBG_STATS_DEV_INC_IF_TRUE(std_req_device_stall_nbr, (valid == false));

  return (valid);
}

/****************************************************************************************************//**
 *                                               usbd_core_interface_stdreq()
 *
 * @brief    Process device standard request (Interface).
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    request     USB device request.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *
 * @note     (1) USB Spec 2.0, section 9.4.10 specifies the format of the SET_INTERFACE request.
 *               This request allows the host to select an alternate setting for the specified
 *               interface:
 *           - (a) Some USB devices have configurations with interfaces that have mutually
 *                   exclusive settings.  This request allows the host to select the desired
 *                   alternate setting.  If a device only supports a default setting for the
 *                   specified interface, then a STALL may be returned in the Status stage of
 *                   the request. This request cannot be used to change the set of configured
 *                   interfaces (the SetConfiguration() request must be used instead).
 *           - (2) USB Spec 2.0, section 9.4.4 specifies the format of the GET_INTERFACE request.
 *               This request returns the selected alternate setting for the specified interface.
 *           - (a) If 'wValue' is non-zero or 'wLength' is not '1', then the device behavior is
 *                   not specified.
 *           - (b) The GET_INTERFACE request is only valid when the device is in the configured
 *                   state.
 *******************************************************************************************************/
static bool usbd_core_interface_stdreq(sli_usbd_device_t   *p_dev,
                                       uint8_t             request)
{
  uint32_t std_req_timeout;
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sli_usbd_alt_interface_t *p_if_alt;
  sl_usbd_class_driver_t *p_class_drv;
  uint8_t if_nbr;
  uint8_t if_alt_nbr;
  bool valid;
  bool dev_to_host;
  uint16_t req_len;
  uint32_t xfer_len;
  sl_status_t status;
  sl_status_t local_status;
  CORE_DECLARE_IRQ_STATE;

  local_status = SL_STATUS_OK;

