espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  CORE_ENTER_ATOMIC();
  std_req_timeout = usbd_ptr->std_req_timeout_ms;
  CORE_EXIT_ATOMIC();

  SLI_USBD_DBG_STATS_DEV_INC(std_req_interface_nbr);

  p_config = p_dev->config_cur_ptr;
  if (p_config == NULL) {
    SLI_USBD_DBG_STATS_DEV_INC(std_req_interface_stall_nbr);
    return (false);
  }

  if_nbr = (uint8_t)(p_dev->setup_req.wIndex & 0xFFu);
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);
  if (p_if == NULL) {
    SLI_USBD_DBG_STATS_DEV_INC(std_req_interface_stall_nbr);
    return (false);
  }

  dev_to_host = SL_IS_BIT_SET(p_dev->setup_req.bmRequestType, SL_USBD_REQ_DIR_BIT);
  valid = false;

  switch (request) {
    case SL_USBD_REQ_GET_STATUS:
      if (dev_to_host != true) {
        break;
      }

      SLI_USBD_LOG_VRB(("USBD: Get Status (Interface) IF ", (u)if_nbr));

      if ((p_dev->state != SL_USBD_DEVICE_STATE_ADDRESSED)
          && (p_dev->state != SL_USBD_DEVICE_STATE_CONFIGURED)) {
        break;
      }

      if ((p_dev->state == SL_USBD_DEVICE_STATE_ADDRESSED)
          && (if_nbr != 0u)) {
        break;
      }

      p_dev->ctrl_status_buf_ptr[0u] = 0x00u;

      status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                               1u,
                                               std_req_timeout,
                                               false,
                                               &xfer_len);
      if (status != SL_STATUS_OK) {
        break;
      }

      valid = true;
      break;

    case SL_USBD_REQ_CLEAR_FEATURE:
    case SL_USBD_REQ_SET_FEATURE:
      if (dev_to_host != false) {
        break;
      }

      if (request == SL_USBD_REQ_CLEAR_FEATURE) {
        SLI_USBD_LOG_VRB(("USBD: Clear Feature (Interface) IF ", (u)if_nbr));
      } else {
        SLI_USBD_LOG_VRB(("USBD: Set Feature (Interface) IF ", (u)if_nbr));
      }

      if ((p_dev->state != SL_USBD_DEVICE_STATE_ADDRESSED)
          && (p_dev->state != SL_USBD_DEVICE_STATE_CONFIGURED)) {
        break;
      }

      if ((p_dev->state == SL_USBD_DEVICE_STATE_ADDRESSED)
          && (if_nbr != 0u)) {
        break;
      }

      valid = true;
      break;

    case SL_USBD_REQ_GET_DESCRIPTOR:
      if (dev_to_host != true) {
        break;
      }

      SLI_USBD_LOG_VRB(("USBD: Get Descriptor (Interface) IF ", (u)if_nbr));

      p_class_drv = p_if->class_driver_ptr;
      if (p_class_drv->interface_req == NULL) {
        break;
      }

      req_len = p_dev->setup_req.wLength;
      usbd_core_start_descriptor_write(p_dev, req_len);

      p_dev->desc_buf_status_ptr = &local_status;

      valid = p_class_drv->interface_req(&p_dev->setup_req,
                                         p_if->class_arg_ptr);
      if (valid == true) {
        status = usbd_core_stop_descriptor_write(p_dev);
        if (status != SL_STATUS_OK) {
          valid = false;
        }
      }
      p_dev->desc_buf_status_ptr = NULL;
      break;

    case SL_USBD_REQ_GET_INTERFACE:
      if (dev_to_host != true) {
        break;
      }

      if (p_dev->state != SL_USBD_DEVICE_STATE_CONFIGURED) {
        break;
      }

      p_dev->ctrl_status_buf_ptr[0u] = p_if->alt_cur;

      SLI_USBD_LOG_VRB(("USBD: Get Interface IF ", (u)if_nbr, " Alt ", (u)p_if->alt_cur));

      status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                               1u,
                                               std_req_timeout,
                                               false,
                                               &xfer_len);
      if (status != SL_STATUS_OK) {
        break;
      }

      valid = true;
      break;

    case SL_USBD_REQ_SET_INTERFACE:
      if (dev_to_host != false) {
        break;
      }

      if (p_dev->state != SL_USBD_DEVICE_STATE_CONFIGURED) {
        break;
      }
      // Get IF alt setting nbr.
      if_alt_nbr = (uint8_t)(p_dev->setup_req.wValue  & 0xFFu);
      p_if_alt = usbd_core_get_alt_interface_structure(p_if, if_alt_nbr);

      SLI_USBD_LOG_VRB(("USBD: Set Interface IF ", (u)if_nbr, " Alt ", (u)if_alt_nbr));

      if (p_if_alt == NULL) {
        SLI_USBD_LOG_ERR(("USBD: Set Interface Invalid Alt IF"));
        break;
      }

      // If alt setting is the same as the cur one, no further processing is needed.
      if (p_if_alt == p_if->alt_cur_ptr) {
        valid = true;
        break;
      }

      // Close the cur alt setting.
      usbd_core_close_alt_interface(p_dev, p_if->alt_cur_ptr);

      // Open the new alt setting.
      status = usbd_core_open_alt_interface(p_dev, if_nbr, p_if_alt);
      // Re-open curr IF alt setting, in case it fails.
      if (status != SL_STATUS_OK) {
        status = usbd_core_open_alt_interface(p_dev, p_if->alt_cur, p_if->alt_cur_ptr);
        break;
      }

      CORE_ENTER_ATOMIC();
      // Set IF alt setting.
      p_if->alt_cur_ptr = p_if_alt;
      p_if->alt_cur = if_alt_nbr;
      CORE_EXIT_ATOMIC();

      // Notify class that IF or alt IF has been updated.
      if (p_if->class_driver_ptr->alt_settings_update != NULL) {
        p_if->class_driver_ptr->alt_settings_update(p_dev->config_cur_nbr,
                                                    if_nbr,
                                                    if_alt_nbr,
                                                    p_if->class_arg_ptr,
                                                    p_if_alt->class_arg_ptr);
      }

      valid = true;
      break;

    default:
      p_class_drv = p_if->class_driver_ptr;
      if (p_class_drv->interface_req == NULL) {
        break;
      }

      valid = p_class_drv->interface_req(&p_dev->setup_req,
                                         p_if->class_arg_ptr);
      break;
  }

  SLI_USBD_DBG_STATS_DEV_INC_IF_TRUE(std_req_interface_stall_nbr, (valid == false));

  return (valid);
}

/****************************************************************************************************//**
 *                                               usbd_core_endpoint_stdreq()
 *
 * @brief    Process device standard request (Endpoint).
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    request     USB device request.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *******************************************************************************************************/
static bool usbd_core_endpoint_stdreq(const sli_usbd_device_t *p_dev,
                                      uint8_t                 request)
{
  uint32_t std_req_timeout;
  sli_usbd_interface_t *p_if;
  sli_usbd_alt_interface_t *p_alt_if;
  bool ep_is_stall;
  uint8_t if_nbr;
  uint8_t ep_addr;
  uint8_t ep_phy_nbr;
  bool valid;
  bool dev_to_host;
  uint8_t feature;
  uint32_t xfer_len;
  sl_status_t status;
  CORE_DECLARE_IRQ_STATE;

