espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  CORE_ENTER_ATOMIC();
  std_req_timeout = usbd_ptr->std_req_timeout_ms;
  CORE_EXIT_ATOMIC();

  SLI_USBD_DBG_STATS_DEV_INC(std_req_endpoint_nbr);

  ep_addr = (uint8_t)(p_dev->setup_req.wIndex & 0xFFu);
  feature = (uint8_t)(p_dev->setup_req.wValue & 0xFFu);
  dev_to_host = SL_IS_BIT_SET(p_dev->setup_req.bmRequestType, SL_USBD_REQ_DIR_BIT);
  valid = false;

  switch (request) {
    case SL_USBD_REQ_CLEAR_FEATURE:
    case SL_USBD_REQ_SET_FEATURE:
      if (dev_to_host != false) {
        break;
      }

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_ADDRESSED:
          if (((ep_addr == 0x80u)
               || (ep_addr == 0x00u))
              && (feature == SL_USBD_FEATURE_SEL_ENDPOINT_HALT)) {
            if (request == SL_USBD_REQ_CLEAR_FEATURE) {
              SLI_USBD_LOG_VRB(("USBD: Clear Feature (EP)(STALL) for EP 0x", (X)SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)));

              status = sl_usbd_core_stall_endpoint(ep_addr, false);
              if (status != SL_STATUS_OK) {
                break;
              }
            } else {
              SLI_USBD_LOG_VRB(("USBD: Set Feature (EP)(STALL) for EP 0x", (X)SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)));

              status = sl_usbd_core_stall_endpoint(ep_addr, true);
              if (status != SL_STATUS_OK) {
                break;
              }
            }

            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_CONFIGURED:
          if (feature == SL_USBD_FEATURE_SEL_ENDPOINT_HALT) {
            if (request == SL_USBD_REQ_CLEAR_FEATURE) {
              SLI_USBD_LOG_VRB(("USBD: Clear Feature (EP)(STALL) for EP 0x", (X)SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)));

              status = sl_usbd_core_stall_endpoint(ep_addr, false);
              if (status != SL_STATUS_OK) {
                break;
              }
            } else {
              SLI_USBD_LOG_VRB(("USBD: Set Feature (EP)(STALL) for EP 0x", (X)SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)));

              status = sl_usbd_core_stall_endpoint(ep_addr, true);
              if (status != SL_STATUS_OK) {
                break;
              }
            }

            ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(ep_addr);
            if_nbr = p_dev->endpoint_interface_table[ep_phy_nbr];
            p_if = usbd_core_get_interface_structure(p_dev->config_cur_ptr, if_nbr);
            p_alt_if = p_if->alt_cur_ptr;

            // Notify class that EP state has been updated.
            if (p_if->class_driver_ptr->endpoint_state_update != NULL) {
              p_if->class_driver_ptr->endpoint_state_update(p_dev->config_cur_nbr,
                                                            if_nbr,
                                                            p_if->alt_cur,
                                                            ep_addr,
                                                            p_if->class_arg_ptr,
                                                            p_alt_if->class_arg_ptr);
            }

            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_DEFAULT:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          break;
      }
      break;

    case SL_USBD_REQ_GET_STATUS:
      if (dev_to_host != true) {
        break;
      }

      p_dev->ctrl_status_buf_ptr[0u] = 0x00u;
      p_dev->ctrl_status_buf_ptr[1u] = 0x00u;

      switch (p_dev->state) {
        case SL_USBD_DEVICE_STATE_ADDRESSED:
          if ((ep_addr == 0x80u)
              || (ep_addr == 0x00u)) {
            SLI_USBD_LOG_VRB(("USBD: Get Status (EP)(STALL) for EP 0x", (X)SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)));
            sl_usbd_core_is_endpoint_stalled(ep_addr, &ep_is_stall);
            if (ep_is_stall == true) {
              p_dev->ctrl_status_buf_ptr[0u] = 0x01u; // BIT_00
              p_dev->ctrl_status_buf_ptr[1u] = 0x00u;
            }

            status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0u],
                                                     2u,
                                                     std_req_timeout,
                                                     false,
                                                     &xfer_len);
            if (status != SL_STATUS_OK) {
              break;
            }

            valid = true;
          }
          break;

        case SL_USBD_DEVICE_STATE_CONFIGURED:
          SLI_USBD_LOG_VRB(("USBD: Get Status (EP)(STALL) for EP 0x", (X)SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)));
          sl_usbd_core_is_endpoint_stalled(ep_addr, &ep_is_stall);
          if (ep_is_stall == true) {
            p_dev->ctrl_status_buf_ptr[0u] = 0x01u; // BIT_00
            p_dev->ctrl_status_buf_ptr[1u] = 0x00u;
          }

          status = sl_usbd_core_write_control_sync((void *)&p_dev->ctrl_status_buf_ptr[0],
                                                   2u,
                                                   std_req_timeout,
                                                   false,
                                                   &xfer_len);
          if (status != SL_STATUS_OK) {
            break;
          }

          valid = true;
          break;

        case SL_USBD_DEVICE_STATE_NONE:
        case SL_USBD_DEVICE_STATE_INIT:
        case SL_USBD_DEVICE_STATE_ATTACHED:
        case SL_USBD_DEVICE_STATE_DEFAULT:
        case SL_USBD_DEVICE_STATE_SUSPENDED:
        default:
          break;
      }
      break;

    default:
      break;
  }

  SLI_USBD_DBG_STATS_DEV_INC_IF_TRUE(std_req_endpoint_stall_nbr, (valid == false));

  return (valid);
}

/****************************************************************************************************//**
 *                                           usbd_core_class_stdreq()
 *
 * @brief    Class standard request handler.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *******************************************************************************************************/
static bool usbd_core_class_stdreq(const sli_usbd_device_t *p_dev)
{
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sl_usbd_class_driver_t *p_class_drv;
  uint8_t recipient;
  uint8_t if_nbr;
  uint8_t ep_addr;
  uint8_t ep_phy_nbr;
  bool valid;

  SLI_USBD_DBG_STATS_DEV_INC(std_req_class_nbr);

  p_config = p_dev->config_cur_ptr;
  if (p_config == NULL) {
    return (false);
  }

  recipient = p_dev->setup_req.bmRequestType & SL_USBD_REQ_RECIPIENT_MASK;

  if (recipient == SL_USBD_REQ_RECIPIENT_INTERFACE) {
    if_nbr = (uint8_t)(p_dev->setup_req.wIndex & 0xFFu);
  } else {
    ep_addr = (uint8_t)(p_dev->setup_req.wIndex & 0xFFu);
    ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(ep_addr);
    if_nbr = p_dev->endpoint_interface_table[ep_phy_nbr];
  }

