espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);
  if (p_if == NULL) {
    SLI_USBD_DBG_STATS_DEV_INC(std_req_class_stall_nbr);
    return (false);
  }

  p_class_drv = p_if->class_driver_ptr;
  if (p_class_drv->class_req == NULL) {
    SLI_USBD_DBG_STATS_DEV_INC(std_req_class_stall_nbr);
    return (false);
  }

  valid = p_class_drv->class_req(&p_dev->setup_req,
                                 p_if->class_arg_ptr);

  SLI_USBD_DBG_STATS_DEV_INC_IF_TRUE(std_req_class_stall_nbr, (valid == false));

  return (valid);
}

/****************************************************************************************************//**
 *                                           usbd_core_vendor_stdreq()
 *
 * @brief    Vendor standard request handler.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *******************************************************************************************************/
static bool usbd_core_vendor_stdreq(const sli_usbd_device_t *p_dev)
{
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sl_usbd_class_driver_t *p_class_drv;
  uint8_t recipient;
  uint8_t if_nbr;
  uint8_t ep_addr;
  uint8_t ep_phy_nbr;
  bool valid;

  p_config = p_dev->config_cur_ptr;
  if (p_config == NULL) {
    return (false);
  }

  recipient = p_dev->setup_req.bmRequestType & SL_USBD_REQ_RECIPIENT_MASK;

  if (recipient == SL_USBD_REQ_RECIPIENT_INTERFACE) {
    if_nbr = (uint8_t)(p_dev->setup_req.wIndex & 0xFFu);
  } else {
    ep_addr = (uint8_t)(p_dev->setup_req.wIndex & 0xFFu);
    ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(ep_addr);
    if_nbr = p_dev->endpoint_interface_table[ep_phy_nbr];
  }

  p_if = usbd_core_get_interface_structure(p_config, if_nbr);
  if (p_if == NULL) {
    return (false);
  }

  p_class_drv = p_if->class_driver_ptr;
  if (p_class_drv->vendor_req == NULL) {
    return (false);
  }

  valid = p_class_drv->vendor_req(&p_dev->setup_req,
                                  p_if->class_arg_ptr);

  return (valid);
}

/****************************************************************************************************//**
 *                                           usbd_core_microsoft_device_stdreq()
 *
 * @brief    Microsoft descriptor request handler (when recipient is device).
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *
 * @note     (1) For more information on Microsoft OS decriptors, see
 *               'http://msdn.microsoft.com/en-us/library/windows/hardware/gg463179.aspx'.
 *
 * @note     (2) Page feature is not supported so Microsoft OS descriptors have their length limited
 *               to 64Kbytes.
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
static bool usbd_core_microsoft_device_stdreq(const sli_usbd_device_t *p_dev)
{
  bool valid;
  uint8_t if_nbr;
  uint8_t max_if;
  uint8_t if_ix;
  uint8_t compat_id_ix;
  uint8_t subcompat_id_ix;
  uint8_t section_cnt;
  uint16_t feature;
  uint16_t len;
  uint8_t cfg_nbr = 0u;
  uint32_t desc_len;
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sl_usbd_class_driver_t *p_class_drv;
  sl_status_t status;

  valid = false;
  feature = p_dev->setup_req.wIndex;
  if_nbr = (uint8_t)(p_dev->setup_req.wValue & 0xFFu);
  len = p_dev->setup_req.wLength;

  // Use 1st cfg as Microsoft doesn't specify cfg in setup pkt.
#if (USBD_CFG_HS_EN == 1)
  if (p_dev->speed == SL_USBD_DEVICE_SPEED_HIGH) {
    p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr | SL_USBD_CONFIG_NBR_SPD_BIT);
  } else {
#endif
  p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr);
#if (USBD_CFG_HS_EN == 1)
}
#endif
  if (p_config == NULL) {
    return (false);
  }

  switch (feature) {
    case SLI_USBD_MICROSOFT_FEATURE_COMPAT_ID:
      // See note (1).
      // Send Desc Header
      // Compute length of descriptor.
      desc_len = SLI_USBD_MICROSOFT_DESC_COMPAT_ID_HDR_LEN;
      section_cnt = 0u;
      if (if_nbr == 0u) {
        // If req IF == 0, sends all dev compat IDs.
        max_if = p_config->interface_nbr_total;
      } else {
        max_if = if_nbr + 1u;
      }

      for (if_ix = if_nbr; if_ix < max_if; if_ix++) {
        p_if = usbd_core_get_interface_structure(p_config, if_ix);
        p_class_drv = p_if->class_driver_ptr;
        if (p_class_drv->microsoft_get_compat_id != NULL) {
          compat_id_ix = p_class_drv->microsoft_get_compat_id(&subcompat_id_ix);
          if (compat_id_ix != SL_USBD_MICROSOFT_COMPAT_ID_NONE) {
            desc_len += SLI_USBD_MICROSOFT_DESC_COMPAT_ID_SECTION_LEN;
            section_cnt++;
          }
        }
      }

      // Wr desc hdr.
      usbd_core_start_descriptor_write((sli_usbd_device_t *)p_dev, desc_len);

      sl_usbd_core_write_32b_to_descriptor_buf(desc_len);
      sl_usbd_core_write_16b_to_descriptor_buf(SLI_USBD_MICROSOFT_DESC_VER_1_0);
      sl_usbd_core_write_16b_to_descriptor_buf(feature);
      sl_usbd_core_write_08b_to_descriptor_buf(section_cnt);
      // Add 7 null bytes (reserved).
      sl_usbd_core_write_32b_to_descriptor_buf(0u);
      sl_usbd_core_write_16b_to_descriptor_buf(0u);
      sl_usbd_core_write_08b_to_descriptor_buf(0u);

      // Send Desc Sections
      if (len != SLI_USBD_MICROSOFT_DESC_COMPAT_ID_HDR_VER_1_0) {
        // If req len = version, only send desc hdr.
        for (if_ix = if_nbr; if_ix < max_if; if_ix++) {
          p_if = usbd_core_get_interface_structure(p_config, if_ix);
          if (p_if->class_driver_ptr->microsoft_get_compat_id != NULL) {
            compat_id_ix = p_if->class_driver_ptr->microsoft_get_compat_id(&subcompat_id_ix);
            if (compat_id_ix != SL_USBD_MICROSOFT_COMPAT_ID_NONE) {
              sl_usbd_core_write_08b_to_descriptor_buf(if_ix);
              sl_usbd_core_write_08b_to_descriptor_buf(0x01u);

              sl_usbd_core_write_buf_to_descriptor_buf((uint8_t *)usbd_microsoft_compat_id[compat_id_ix],
                                                       8u);

              sl_usbd_core_write_buf_to_descriptor_buf((uint8_t *)usbd_microsoft_subcompat_id[subcompat_id_ix],
                                                       8u);

              // Add 6 null bytes (reserved).
              sl_usbd_core_write_32b_to_descriptor_buf(0u);
              sl_usbd_core_write_16b_to_descriptor_buf(0u);
            }
          }
        }
      }

