espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
      if (*(p_dev->desc_buf_status_ptr) == SL_STATUS_OK) {
        status = usbd_core_stop_descriptor_write((sli_usbd_device_t *)p_dev);
        *(p_dev->desc_buf_status_ptr) = status;
      }

      if (*(p_dev->desc_buf_status_ptr) == SL_STATUS_OK) {
        valid = true;
      }
      break;

    case SLI_USBD_MICROSOFT_FEATURE_EXT_PROPERTIES:
      valid = usbd_core_microsoft_ext_property_stdreq(p_dev,
                                                      p_config,
                                                      if_nbr,
                                                      len);
      break;

    default:
      break;
  }

  return (valid);
}
#endif

/****************************************************************************************************//**
 *                                           usbd_core_microsoft_interface_stdreq()
 *
 * @brief    Microsoft descriptor request handler (when recipient is interface).
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *
 * @note     (1) For more information on Microsoft OS decriptors, see
 *               'http://msdn.microsoft.com/en-us/library/windows/hardware/gg463179.aspx'.
 *
 * @note     (2) Page feature is not supported so Microsoft OS descriptors have their length limited
 *               to 64Kbytes.
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
static bool usbd_core_microsoft_interface_stdreq(const sli_usbd_device_t *p_dev)
{
  bool valid = false;
  uint8_t if_nbr = (uint8_t)(p_dev->setup_req.wValue & 0xFFu);
  uint16_t feature = p_dev->setup_req.wIndex;
  uint16_t len = p_dev->setup_req.wLength;
  sli_usbd_configuration_t *p_config;

  // Use 1st cfg as Microsoft doesn't specify cfg in setup pkt.
#if (USBD_CFG_HS_EN == 1)
  if (p_dev->speed == SL_USBD_DEVICE_SPEED_HIGH) {
    p_config = usbd_core_get_configuration_structure(p_dev, 0u | SL_USBD_CONFIG_NBR_SPD_BIT);
  } else {
#endif
  p_config = usbd_core_get_configuration_structure(p_dev, 0u);
#if (USBD_CFG_HS_EN == 1)
}
#endif
  if (p_config == NULL) {
    return (false);
  }

  switch (feature) {
    case SLI_USBD_MICROSOFT_FEATURE_EXT_PROPERTIES:
      valid = usbd_core_microsoft_ext_property_stdreq(p_dev,
                                                      p_config,
                                                      if_nbr,
                                                      len);
      break;

    default:
      break;
  }

  return (valid);
}
#endif

/****************************************************************************************************//**
 *                                           usbd_core_microsoft_ext_property_stdreq()
 *
 * @brief    Microsoft descriptor request handler (when recipient is interface).
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    if_nbr  Interface number.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    len     Length of descriptor as requested by host.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *
 * @note     (1) For more information on Microsoft OS decriptors, see
 *               'http://msdn.microsoft.com/en-us/library/windows/hardware/gg463179.aspx'.
 *
 * @note     (2) Page feature is not supported so Microsoft OS descriptors have their length limited
 *               to 64Kbytes.
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
static bool usbd_core_microsoft_ext_property_stdreq(const sli_usbd_device_t     *p_dev,
                                                    sli_usbd_configuration_t    *p_config,
                                                    uint8_t                     if_nbr,
                                                    uint16_t                    len)
{
  bool valid = false;
  uint8_t section_cnt = 0u;
  uint8_t ext_property_cnt;
  uint8_t ext_property_ix;
  uint32_t desc_len = SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_HDR_LEN;
  sli_usbd_interface_t *p_if;
  sl_usbd_class_driver_t *p_class_drv;
  sl_usbd_microsoft_ext_property_t *p_ext_property;
  sl_status_t status;

  // Send Desc Header
  // Compute length of descriptor.
  p_if = usbd_core_get_interface_structure(p_config, if_nbr);
  p_class_drv = p_if->class_driver_ptr;

  if (p_class_drv->microsoft_get_ext_property_table != NULL) {
    ext_property_cnt = p_class_drv->microsoft_get_ext_property_table(&p_ext_property, if_nbr);
    for (ext_property_ix = 0u; ext_property_ix < ext_property_cnt; ext_property_ix++) {
      desc_len += SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_SECTION_HDR_LEN;
      desc_len += p_ext_property->property_name_len;
      desc_len += p_ext_property->property_len;
      desc_len += 6u;

      section_cnt++;
      p_ext_property++;
    }
  }

  usbd_core_start_descriptor_write((sli_usbd_device_t *)p_dev, desc_len);

  sl_usbd_core_write_32b_to_descriptor_buf(desc_len);
  sl_usbd_core_write_16b_to_descriptor_buf(SLI_USBD_MICROSOFT_DESC_VER_1_0);
  sl_usbd_core_write_16b_to_descriptor_buf(SLI_USBD_MICROSOFT_FEATURE_EXT_PROPERTIES);
  sl_usbd_core_write_16b_to_descriptor_buf(section_cnt);

  // Send Desc Sections
  // If req len = version, only send desc hdr.
  if ((len != SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_HDR_VER_1_0)
      && (p_class_drv->microsoft_get_ext_property_table != NULL)) {
    ext_property_cnt = p_class_drv->microsoft_get_ext_property_table(&p_ext_property, if_nbr);
    for (ext_property_ix = 0u; ext_property_ix < ext_property_cnt; ext_property_ix++) {
      // Compute desc section len.
      desc_len = SLI_USBD_MICROSOFT_DESC_EXT_PROPERTIES_SECTION_HDR_LEN;
      desc_len += p_ext_property->property_name_len;
      desc_len += p_ext_property->property_len;
      desc_len += 6u;

      // Wr desc section.
      sl_usbd_core_write_32b_to_descriptor_buf(desc_len);
      sl_usbd_core_write_32b_to_descriptor_buf(p_ext_property->property_type);

      sl_usbd_core_write_16b_to_descriptor_buf(p_ext_property->property_name_len);
      sl_usbd_core_write_buf_to_descriptor_buf((uint8_t *)p_ext_property->property_name_ptr,
                                               p_ext_property->property_name_len);

      sl_usbd_core_write_32b_to_descriptor_buf(p_ext_property->property_len);
      sl_usbd_core_write_buf_to_descriptor_buf((uint8_t *)p_ext_property->property_ptr,
                                               p_ext_property->property_len);

      p_ext_property++;
    }
  }

