espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  if (*(p_dev->desc_buf_status_ptr) == SL_STATUS_OK) {
    status = usbd_core_stop_descriptor_write((sli_usbd_device_t *)p_dev);
    *(p_dev->desc_buf_status_ptr) = status;
  }

  if (*(p_dev->desc_buf_status_ptr) == SL_STATUS_OK) {
    valid = true;
  }

  return (valid);
}
#endif

/****************************************************************************************************//**
 *                                           usbd_core_get_descriptor_stdreq()
 *
 * @brief    GET_DESCRIPTOR standard request handler.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   true,   if no error(s) occurred and request is supported.
 *           false, if any errors are returned.
 *******************************************************************************************************/
static bool usbd_core_get_descriptor_stdreq(sli_usbd_device_t *p_dev)
{
  uint8_t desc_type;
  uint8_t desc_ix;
  uint16_t req_len;
  bool valid;
  sl_status_t local_status;
  sl_status_t status;
#if (USBD_CFG_HS_EN == 1)
  sl_usbd_device_speed_t drv_spd;
#endif

  local_status = SL_STATUS_OK;

  desc_type = (uint8_t)((p_dev->setup_req.wValue >> 8u) & 0xFFu);
  desc_ix = (uint8_t)(p_dev->setup_req.wValue        & 0xFFu);
  valid = false;
  req_len = p_dev->setup_req.wLength;
  // Set the desc buf as the current buf.
  p_dev->actual_buf_ptr = p_dev->desc_buf_ptr;
  // Set the max len for the desc buf.
  p_dev->desc_buf_max_len = SLI_USBD_DESC_BUF_LEN;
  p_dev->desc_buf_status_ptr = &local_status;

  switch (desc_type) {
    case SL_USBD_DESC_TYPE_DEVICE:
      SLI_USBD_LOG_VRB(("USBD: Get Descriptor (Device)"));
      status = usbd_core_send_device_descriptor(p_dev, false, req_len);
      if (status == SL_STATUS_OK) {
        valid = true;
      }
      break;

    case SL_USBD_DESC_TYPE_CONFIGURATION:
      SLI_USBD_LOG_VRB(("USBD: Get Descriptor (Configuration) ix #", (u)desc_ix));
      status = usbd_core_send_configuration_descriptor(p_dev, desc_ix, false, req_len);
      if (status != SL_STATUS_OK) {
        SLI_USBD_LOG_ERR(("USBD Get Descriptor (Configuration) Failed. status = ", status));
      } else {
        valid = true;
      }
      break;

    case SL_USBD_DESC_TYPE_STRING:
      SLI_USBD_LOG_VRB(("USBD: Get Descriptor (String) ix #", (u)desc_ix));
#if (USBD_CFG_STR_EN == 1)
      status = usbd_core_send_string_descriptor(p_dev, desc_ix, req_len);
      if (status == SL_STATUS_OK) {
        valid = true;
      }
#endif
      break;

    case SL_USBD_DESC_TYPE_DEVICE_QUALIFIER:
      SLI_USBD_LOG_VRB(("USBD: Get Descriptor (Device Qualifier)"));
#if (USBD_CFG_HS_EN == 1)
      sli_usbd_driver_get_speed(&drv_spd);

      // Chk if dev only supports FS.
      if (drv_spd == SL_USBD_DEVICE_SPEED_FULL) {
        break;
      }

      status = usbd_core_send_device_descriptor(p_dev, true, req_len);

      if (status == SL_STATUS_OK) {
        valid = true;
      }
#endif
      break;

    case SL_USBD_DESC_TYPE_OTHER_SPEED_CONFIGURATION:
      SLI_USBD_LOG_VRB(("USBD: Get Descriptor (Other Speed)"));
#if (USBD_CFG_HS_EN == 1)
      sli_usbd_driver_get_speed(&drv_spd);

      if (drv_spd == SL_USBD_DEVICE_SPEED_FULL) {
        break;
      }

      status = usbd_core_send_configuration_descriptor(p_dev, desc_ix, true, req_len);

      if (status == SL_STATUS_OK) {
        valid = true;
      }
#endif
      break;

    default:
      break;
  }

  p_dev->desc_buf_status_ptr = NULL;
  return (valid);
}

/****************************************************************************************************//**
 *                                               usbd_core_unset_configuration()
 *
 * @brief    Close current device configuration.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----  Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue and
 *                   'sl_usbd_core_stop_device()' function.
 *******************************************************************************************************/
static void usbd_core_unset_configuration(sli_usbd_device_t *p_dev)
{
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sli_usbd_alt_interface_t *p_if_alt;
  uint8_t if_nbr;
  CORE_DECLARE_IRQ_STATE;

  p_config = p_dev->config_cur_ptr;
  if (p_config == NULL) {
    return;
  }

  // Notify app about clr cfg.
  sl_usbd_on_config_event(SL_USBD_EVENT_CONFIG_UNSET, p_dev->config_cur_nbr);

  for (if_nbr = 0u; if_nbr < p_config->interface_nbr_total; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);
    if (p_if == NULL) {
      return;
    }

    p_if_alt = p_if->alt_cur_ptr;
    if (p_if_alt == NULL) {
      return;
    }

    if (p_if->class_driver_ptr->disable != NULL) {
      // Notify class that cfg is not active.
      p_if->class_driver_ptr->disable(p_dev->config_cur_nbr,
                                      p_if->class_arg_ptr);
    }
  }

  CORE_ENTER_ATOMIC();
  p_dev->state = SL_USBD_DEVICE_STATE_ADDRESSED;
  CORE_EXIT_ATOMIC();

  for (if_nbr = 0u; if_nbr < p_config->interface_nbr_total; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);
    if (p_if == NULL) {
      return;
    }

    p_if_alt = p_if->alt_cur_ptr;
    if (p_if_alt == NULL) {
      return;
    }

    usbd_core_close_alt_interface(p_dev, p_if_alt);

    p_if_alt = usbd_core_get_alt_interface_structure(p_if, 0u);

    CORE_ENTER_ATOMIC();
    p_if->alt_cur_ptr = p_if_alt;
    p_if->alt_cur = 0u;
    CORE_EXIT_ATOMIC();
  }

  CORE_ENTER_ATOMIC();
  p_dev->config_cur_ptr = NULL;
  p_dev->config_cur_nbr = SL_USBD_CONFIG_NBR_NONE;
  CORE_EXIT_ATOMIC();
}

/****************************************************************************************************//**
 *                                               usbd_core_set_configuration()
 *
 * @brief    Open specified configuration.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    config_nbr  Configuration number.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
static sl_status_t usbd_core_set_configuration(sli_usbd_device_t   *p_dev,
                                               uint8_t             config_nbr)

{
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sli_usbd_alt_interface_t *p_if_alt;
  uint8_t if_nbr;
  sl_status_t status;
  CORE_DECLARE_IRQ_STATE;

#if (USBD_CFG_HS_EN == 1)
  if (p_dev->speed == SL_USBD_DEVICE_SPEED_HIGH) {
    p_config = usbd_core_get_configuration_structure(p_dev, config_nbr | SL_USBD_CONFIG_NBR_SPD_BIT);
  } else {
#endif
  p_config = usbd_core_get_configuration_structure(p_dev, config_nbr);
#if (USBD_CFG_HS_EN == 1)
}
#endif

  if (p_config == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  for (if_nbr = 0u; if_nbr < p_config->interface_nbr_total; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);
    if (p_if == NULL) {
      return SL_STATUS_INVALID_PARAMETER;
    }

    p_if_alt = p_if->alt_cur_ptr;
    if (p_if_alt == NULL) {
      return SL_STATUS_INVALID_PARAMETER;
    }

    status = usbd_core_open_alt_interface(p_dev, if_nbr, p_if_alt);

