espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
    if (status != SL_STATUS_OK) {
      return status;
    }
  }

  CORE_ENTER_ATOMIC();
  p_dev->config_cur_ptr = p_config;
  p_dev->config_cur_nbr = config_nbr;
  CORE_EXIT_ATOMIC();

  CORE_ENTER_ATOMIC();
  p_dev->state = SL_USBD_DEVICE_STATE_CONFIGURED;
  CORE_EXIT_ATOMIC();

  for (if_nbr = 0u; if_nbr < p_config->interface_nbr_total; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);
    if (p_if == NULL) {
      return SL_STATUS_INVALID_PARAMETER;
    } else {
      if (p_if->class_driver_ptr->enable != NULL) {
        // Notify class that cfg is active.
        p_if->class_driver_ptr->enable(config_nbr,
                                       p_if->class_arg_ptr);
      }
    }
  }

  // Notify app about set cfg.
  sl_usbd_on_config_event(SL_USBD_EVENT_CONFIG_SET, config_nbr);

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 *                                           usbd_core_send_device_descriptor()
 *
 * @brief    Send device configuration descriptor.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    other       Other speed configuration :
 *                           - true     Current speed.
 *                           - false      Other operational speed.
 *
 * @param    req_len     Requested length by the host.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB Spec 2.0 table 9-8 describes the standard device descriptor.
 *
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               | Offset |        Field       |  size |   Value  |            Description            |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    0   | bLength            |   1   | Number   | size of this descriptor           |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    1   | bDescriptorType    |   1   | Const    | DEVICE Descriptor type            |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    2   | bcdUSB             |   2   | BCD USB  | Specification release number      |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    4   | bDeviceClass       |   1   | Class    | Class code.                       |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    5   | bDeviceSubClass    |   1   | SubClass | Subclass code.                    |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    6   | bDeviceProtocol    |   1   | protocol | protocol code.                    |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    7   | bMaxPacketSize0    |   1   | Number   | Max packet size for EP zero       |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |    8   | idVendor           |   2   | id       | Vendor  id                        |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |   10   | idProduct          |   2   | id       | Product id                        |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |   12   | bcdDevice          |   2   | BCD      | Dev release number in BCD format  |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |   14   | iManufacturer      |   1   | Index    | Index of manufacturer string      |
 *               +--------+--------------------+-------+----------+-----------------------------------+
 *               |   15   | iProduct           |   1   | Index    | Index of product string           |
 *               +--------|--------------------|-------|----------|-----------------------------------+
 *               |   16   | iSerialNumber      |   1   | Index    | Index of serial number string     |
 *               +--------|--------------------|-------|----------|-----------------------------------+
 *               |   17   | bNumConfigurations |   1   |  Number  | Number of possible configurations |
 *               +--------|--------------------|-------|----------|-----------------------------------+
 *
 *           ) To enable host to identify devices that use the Interface Association descriptor the
 *           device descriptor should contain the following values.
 *******************************************************************************************************/
static sl_status_t usbd_core_send_device_descriptor(sli_usbd_device_t    *p_dev,
                                                    bool                 other,
                                                    uint16_t             req_len)
{
  sli_usbd_configuration_t *p_config;
  bool if_grp_en;
  uint8_t cfg_nbr;
  uint8_t cfg_nbr_spd;
  uint8_t cfg_nbr_total;
  sl_usbd_device_speed_t drv_spd;
#if (USBD_CFG_STR_EN == 1)
  uint8_t str_ix;
#endif

#if (USBD_CFG_HS_EN == 0)
  (void)&other;
  (void)&drv_spd;
#endif

  if_grp_en = false;

#if (USBD_CFG_HS_EN == 1)
  if (other == false) {
#endif
  usbd_core_start_descriptor_write(p_dev, req_len);
  // Desc len.
  usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_DEV);
  // Dev desc type.
  usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_DEVICE);
  // USB spec release nbr in BCD fmt (2.00).
  usbd_core_write_16b_to_descriptor_buf(p_dev, 0x200u);

#if (USBD_CFG_HS_EN == 1)
  if (p_dev->speed == SL_USBD_DEVICE_SPEED_FULL) {
#endif
  cfg_nbr_spd = 0x00u;
  cfg_nbr_total = p_dev->config_fs_total_nbr;
#if (USBD_CFG_HS_EN == 1)
} else {
  cfg_nbr_spd = SL_USBD_CONFIG_NBR_SPD_BIT;
  cfg_nbr_total = p_dev->config_hs_total_nbr;
}
#endif

  cfg_nbr = 0u;
  while ((cfg_nbr < cfg_nbr_total)
         && (if_grp_en == false)) {
    p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr | cfg_nbr_spd);
    if (p_config != NULL) {
      if (p_config->interface_group_nbr_total > 0u) {
        if_grp_en = true;
      }
    }

    cfg_nbr++;
  }

  if (if_grp_en == false) {
    // Dev class is specified in IF desc.
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_CLASS_CODE_USE_IF_DESC);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_SUBCLASS_CODE_USE_IF_DESC);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_PROTOCOL_CODE_USE_IF_DESC);
  } else {
    // Multi-Interface function dev class.
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_CLASS_CODE_MISCELLANEOUS);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_SUBCLASS_CODE_USE_COMMON_CLASS);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_PROTOCOL_CODE_USE_IAD);
  }
  // Set max pkt size for ctrl EP.
  usbd_core_write_08b_to_descriptor_buf(p_dev, (uint8_t)p_dev->endpoint_max_ctrl_pkt_size);
  // Set vendor id, product id and dev id.
  usbd_core_write_16b_to_descriptor_buf(p_dev, p_dev->device_config.vendor_id);
  usbd_core_write_16b_to_descriptor_buf(p_dev, p_dev->device_config.product_id);
  usbd_core_write_16b_to_descriptor_buf(p_dev, p_dev->device_config.device_bcd);

#if (USBD_CFG_STR_EN == 1)
  str_ix = usbd_core_get_string_index(p_dev, p_dev->device_config.manufacturer_str_ptr);
  usbd_core_write_08b_to_descriptor_buf(p_dev, str_ix);
  str_ix = usbd_core_get_string_index(p_dev, p_dev->device_config.product_str_ptr);
  usbd_core_write_08b_to_descriptor_buf(p_dev, str_ix);
  str_ix = usbd_core_get_string_index(p_dev, p_dev->device_config.serial_nbr_str_ptr);
  usbd_core_write_08b_to_descriptor_buf(p_dev, str_ix);
#else
  usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
  usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
  usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
#endif
  usbd_core_write_08b_to_descriptor_buf(p_dev, cfg_nbr_total);

#if (USBD_CFG_HS_EN == 1)
} else {
  sli_usbd_driver_get_speed(&drv_spd);
  if (drv_spd != SL_USBD_DEVICE_SPEED_HIGH) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  usbd_core_start_descriptor_write(p_dev, req_len);
  // Desc len.
  usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_DEV_QUAL);
  usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_DEVICE_QUALIFIER);
  // USB spec release nbr in BCD fmt (2.00).
  usbd_core_write_16b_to_descriptor_buf(p_dev, 0x200u);

  if (p_dev->speed == SL_USBD_DEVICE_SPEED_HIGH) {
    cfg_nbr_spd = 0x00u;
    cfg_nbr_total = p_dev->config_fs_total_nbr;
  } else {
    cfg_nbr_spd = SL_USBD_CONFIG_NBR_SPD_BIT;
    cfg_nbr_total = p_dev->config_hs_total_nbr;
  }

  cfg_nbr = 0u;
  while ((cfg_nbr < cfg_nbr_total)
         && (if_grp_en == false)) {
    p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr | cfg_nbr_spd);
    if (p_config != NULL) {
      if (p_config->interface_group_nbr_total > 0u) {
        if_grp_en = true;
      }
      cfg_nbr++;
    }
  }
  if (if_grp_en == false) {
    // Dev class is specified in IF desc.
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_CLASS_CODE_USE_IF_DESC);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_SUBCLASS_CODE_USE_IF_DESC);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_PROTOCOL_CODE_USE_IF_DESC);
  } else {
    // Multi-Interface function dev class.
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_CLASS_CODE_MISCELLANEOUS);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_SUBCLASS_CODE_USE_COMMON_CLASS);
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_PROTOCOL_CODE_USE_IAD);
  }
  // Set max pkt size for ctrl EP.
  usbd_core_write_08b_to_descriptor_buf(p_dev, (uint8_t)p_dev->endpoint_max_ctrl_pkt_size);
  usbd_core_write_08b_to_descriptor_buf(p_dev, cfg_nbr_total);
  usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
}
#endif

  return usbd_core_stop_descriptor_write(p_dev);
}

/****************************************************************************************************//**
 *                                           usbd_core_send_configuration_descriptor()
 *
 * @brief    Send configuration descriptor.
 *
 * @param    p_dev       Pointer to device struct.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    cfg_nbr     Configuration number.
 *
 * @param    other       Other speed configuration :
 *                       false      Descriptor is build for the current speed.
 *                       true     Descriptor is build for the  other  speed.
 *
 * @param    req_len     Requested length by the host.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
static sl_status_t usbd_core_send_configuration_descriptor(sli_usbd_device_t    *p_dev,
                                                           uint8_t              config_nbr,
                                                           bool                 other,
                                                           uint16_t             req_len)
{
  sli_usbd_configuration_t *p_config;
  sli_usbd_interface_t *p_if;
  sli_usbd_endpoint_info_t *p_ep;
  sli_usbd_alt_interface_t *p_if_alt;
  sli_usbd_interface_group_t *p_if_grp;
  sl_usbd_class_driver_t *p_if_drv;
  uint8_t cfg_nbr_cur;
  uint8_t ep_nbr;
  uint8_t if_nbr;
  uint8_t if_total;
  uint8_t if_grp_cur;
  uint8_t if_alt_nbr;
  uint8_t attrib;
#if (USBD_CFG_STR_EN == 1)
  uint8_t str_ix;
#endif
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  uint32_t ep_alloc_map;
#endif

#if (USBD_CFG_HS_EN == 1)
  if (p_dev->speed == SL_USBD_DEVICE_SPEED_HIGH) {
    cfg_nbr_cur = config_nbr | SL_USBD_CONFIG_NBR_SPD_BIT;
  } else {
#endif
  cfg_nbr_cur = config_nbr;
#if (USBD_CFG_HS_EN == 1)
}
#endif

  p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr_cur);

  if (p_config == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

#if (USBD_CFG_HS_EN == 1)
  // other will always be false when HS is disabled.
  if (other == true) {
    if (p_config->config_other_speed == SL_USBD_CONFIG_NBR_NONE) {
      return SL_STATUS_INVALID_PARAMETER;
    }

    cfg_nbr_cur = p_config->config_other_speed;

