espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
    // Retrieve cfg struct for other spd.
    p_config = usbd_core_get_configuration_structure(p_dev, cfg_nbr_cur);
    if (p_config == NULL) {
      return SL_STATUS_INVALID_PARAMETER;
    }
  }
#endif

  // Init cfg desc len.
  p_config->desc_len = SL_USBD_DESC_LEN_CFG;

  // Build Configuration Descriptor
  usbd_core_start_descriptor_write(p_dev, req_len);

  // Desc len.
  usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_CFG);
  // Desc type.
  if (other == true) {
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_OTHER_SPEED_CONFIGURATION);
  } else {
    usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_CONFIGURATION);
  }

  if_total = p_config->interface_nbr_total;
  if_grp_cur = SL_USBD_INTERFACE_GROUP_NBR_NONE;

  for (if_nbr = 0u; if_nbr < if_total; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);
    p_if_drv = p_if->class_driver_ptr;

    if ((p_if->group_nbr != if_grp_cur)
        && (p_if->group_nbr != SL_USBD_INTERFACE_GROUP_NBR_NONE)) {
      // Add IF assoc desc len.
      p_config->desc_len += SL_USBD_DESC_LEN_IF_ASSOCIATION;
      if_grp_cur = p_if->group_nbr;
    }

    p_config->desc_len += (SL_USBD_DESC_LEN_IF * p_if->alt_nbr_total);

    for (if_alt_nbr = 0u; if_alt_nbr < p_if->alt_nbr_total; if_alt_nbr++) {
      p_if_alt = usbd_core_get_alt_interface_structure(p_if, if_alt_nbr);
      p_config->desc_len += (SL_USBD_DESC_LEN_EP * p_if_alt->endpoint_nbr_total);

      // Add IF functional desc len.
      if (p_if_drv->interface_get_descriptor_size != NULL) {
        p_config->desc_len += p_if_drv->interface_get_descriptor_size(cfg_nbr_cur,
                                                                      if_nbr,
                                                                      if_alt_nbr,
                                                                      p_if->class_arg_ptr,
                                                                      p_if_alt->class_arg_ptr);
      }

#if (USBD_CFG_OPTIMIZE_SPD == 1)
      ep_alloc_map = p_if_alt->endpoint_table_map;
      while (ep_alloc_map != 0x00u) {
        ep_nbr = (uint8_t)__CLZ(__RBIT(ep_alloc_map));
        p_ep = p_if_alt->endpoint_table_ptrs[ep_nbr];

        // Add EP functional desc len.
        if (p_if_drv->endpoint_get_descriptor_size != NULL) {
          p_config->desc_len += p_if_drv->endpoint_get_descriptor_size(cfg_nbr_cur,
                                                                       if_nbr,
                                                                       if_alt_nbr,
                                                                       p_ep->address,
                                                                       p_if->class_arg_ptr,
                                                                       p_if_alt->class_arg_ptr);
        }

        if ((p_if->class_code == SL_USBD_CLASS_CODE_AUDIO)
            && (p_if->class_protocol_code == 0u)
            && (((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_ISOC)
                || ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_INTR))) {
          // EP desc on audio class v1.0 has 2 additional fields.
          p_config->desc_len += 2u;
        }

        SL_CLEAR_BIT(ep_alloc_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
      }
#else
      p_ep = p_if_alt->endpoint_head_ptr;

      for (ep_nbr = 0u; ep_nbr < p_if_alt->endpoint_nbr_total; ep_nbr++) {
        if (p_if_drv->endpoint_get_descriptor_size != NULL) {
          p_config->desc_len += p_if_drv->endpoint_get_descriptor_size(cfg_nbr_cur,
                                                                       if_nbr,
                                                                       if_alt_nbr,
                                                                       p_ep->address,
                                                                       p_if->class_arg_ptr,
                                                                       p_if_alt->class_arg_ptr);
        }

        if ((p_if->class_code == SL_USBD_CLASS_CODE_AUDIO)
            && (p_if->class_protocol_code == 0u)
            && (((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_ISOC)
                || ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_INTR))) {
          // EP desc on audio class v1.0 has 2 additional fields.
          p_config->desc_len += 2u;
        }

        p_ep = p_ep->next_ptr;
      }
#endif
    }
  }

  // Build Cfg Desc
  // Desc len.
  usbd_core_write_16b_to_descriptor_buf(p_dev, p_config->desc_len);
  // nbr of IF.
  usbd_core_write_08b_to_descriptor_buf(p_dev, p_config->interface_nbr_total);
  // Cfg ix.
  usbd_core_write_08b_to_descriptor_buf(p_dev, config_nbr + 1u);

#if (USBD_CFG_STR_EN == 1)
  // Add str ix.
  str_ix = usbd_core_get_string_index(p_dev, p_config->name_ptr);
  usbd_core_write_08b_to_descriptor_buf(p_dev, str_ix);
#else
  usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
#endif

  attrib = SLI_USBD_CONFIG_DESC_RSVD_SET;
  if (SL_IS_BIT_SET(p_config->attrib, SL_USBD_DEV_ATTRIB_SELF_POWERED)) {
    SL_SET_BIT(attrib, SLI_USBD_CONFIG_DESC_SELF_POWERED);
  }
  if (SL_IS_BIT_SET(p_config->attrib, SL_USBD_DEV_ATTRIB_REMOTE_WAKEUP)) {
    SL_SET_BIT(attrib, SLI_USBD_CONFIG_DESC_REMOTE_WAKEUP);
  }
  usbd_core_write_08b_to_descriptor_buf(p_dev, attrib);
  usbd_core_write_08b_to_descriptor_buf(p_dev, (uint8_t)((p_config->max_power + 1u) / 2u));

  // Build Interface Descriptor
  if_total = p_config->interface_nbr_total;
  if_grp_cur = SL_USBD_INTERFACE_GROUP_NBR_NONE;

  for (if_nbr = 0u; if_nbr < if_total; if_nbr++) {
    p_if = usbd_core_get_interface_structure(p_config, if_nbr);
    p_if_drv = p_if->class_driver_ptr;

    if ((p_if->group_nbr != if_grp_cur)
        && (p_if->group_nbr != SL_USBD_INTERFACE_GROUP_NBR_NONE)) {
      // Add IF assoc desc (IAD).
      p_if_grp = usbd_core_get_interface_group_structure(p_config, p_if->group_nbr);

      usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_IF_ASSOCIATION);
      usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_IAD);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if_grp->interface_start);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if_grp->interface_count);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if_grp->class_code);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if_grp->class_sub_code);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if_grp->class_protocol_code);

#if (USBD_CFG_STR_EN == 1)
      str_ix = usbd_core_get_string_index(p_dev, p_if_grp->name_ptr);
      usbd_core_write_08b_to_descriptor_buf(p_dev, str_ix);
#else
      usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
#endif

      if_grp_cur = p_if->group_nbr;
    }
    // Add IF/alt settings desc.
    for (if_alt_nbr = 0u; if_alt_nbr < p_if->alt_nbr_total; if_alt_nbr++) {
      p_if_alt = usbd_core_get_alt_interface_structure(p_if, if_alt_nbr);

      usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_IF);
      usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_INTERFACE);
      usbd_core_write_08b_to_descriptor_buf(p_dev, if_nbr);
      usbd_core_write_08b_to_descriptor_buf(p_dev, if_alt_nbr);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if_alt->endpoint_nbr_total);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if->class_code);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if->class_sub_code);
      usbd_core_write_08b_to_descriptor_buf(p_dev, p_if->class_protocol_code);

#if (USBD_CFG_STR_EN == 1)
      str_ix = usbd_core_get_string_index(p_dev, p_if_alt->name_ptr);
      usbd_core_write_08b_to_descriptor_buf(p_dev, str_ix);
#else
      usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
#endif

      if (p_if_drv->interface_descriptor != NULL) {
        // Add class specific IF desc.
        p_if_drv->interface_descriptor(cfg_nbr_cur,
                                       if_nbr,
                                       if_alt_nbr,
                                       p_if->class_arg_ptr,
                                       p_if_alt->class_arg_ptr);
      }
      // Build EP Desc
#if (USBD_CFG_OPTIMIZE_SPD == 1)
      ep_alloc_map = p_if_alt->endpoint_table_map;
      while (ep_alloc_map != 0x00u) {
        ep_nbr = (uint8_t)__CLZ(__RBIT(ep_alloc_map));
        p_ep = p_if_alt->endpoint_table_ptrs[ep_nbr];

        if ((p_if->class_code == SL_USBD_CLASS_CODE_AUDIO)
            && (p_if->class_protocol_code == 0u)
            && (((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_ISOC)
                || ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_INTR))) {
          // EP desc on audio class v1.0 has 2 additional fields.
          usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_EP + 2u);
        } else {
          usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_EP);
        }

