espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
        usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_ENDPOINT);
        usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->address);
        usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->attrib);
        usbd_core_write_16b_to_descriptor_buf(p_dev, p_ep->max_pkt_size);
        usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->interval);

        if ((p_if->class_code == SL_USBD_CLASS_CODE_AUDIO)
            && (p_if->class_protocol_code == 0u)
            && (((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_ISOC)
                || ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_INTR))) {
          // EP desc on audio class v1.0 has 2 additional fields.
          usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->sync_refresh);
          usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->sync_addr);
        }

        if (p_if_drv->endpoint_descriptor != NULL) {
          // Add class specific EP desc.
          p_if_drv->endpoint_descriptor(cfg_nbr_cur,
                                        if_nbr,
                                        if_alt_nbr,
                                        p_ep->address,
                                        p_if->class_arg_ptr,
                                        p_if_alt->class_arg_ptr);
        }

        SL_CLEAR_BIT(ep_alloc_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
      }
#else
      p_ep = p_if_alt->endpoint_head_ptr;

      for (ep_nbr = 0u; ep_nbr < p_if_alt->endpoint_nbr_total; ep_nbr++) {
        if ((p_if->class_code == SL_USBD_CLASS_CODE_AUDIO)
            && (p_if->class_protocol_code == 0u)
            && (((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_ISOC)
                || ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_INTR))) {
          // EP desc on audio class v1.0 has 2 additional fields.
          usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_EP + 2u);
        } else {
          usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_LEN_EP);
        }

        usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_ENDPOINT);
        usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->address);
        usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->attrib);
        usbd_core_write_16b_to_descriptor_buf(p_dev, p_ep->max_pkt_size);
        usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->interval);

        if ((p_if->class_code == SL_USBD_CLASS_CODE_AUDIO)
            && (p_if->class_protocol_code == 0u)
            && (((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_ISOC)
                || ((p_ep->attrib & SL_USBD_ENDPOINT_TYPE_MASK) == SL_USBD_ENDPOINT_TYPE_INTR))) {
          // EP desc on audio class v1.0 has 2 additional fields.
          usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->sync_refresh);
          usbd_core_write_08b_to_descriptor_buf(p_dev, p_ep->sync_addr);
        }

        if (p_if_drv->endpoint_descriptor != NULL) {
          // Add class specific EP desc.
          p_if_drv->endpoint_descriptor(cfg_nbr_cur,
                                        if_nbr,
                                        if_alt_nbr,
                                        p_ep->address,
                                        p_if->class_arg_ptr,
                                        p_if_alt->class_arg_ptr);
        }

        p_ep = p_ep->next_ptr;
      }
#endif
    }
  }

  return usbd_core_stop_descriptor_write(p_dev);
}

/****************************************************************************************************//**
 *                                           usbd_core_send_string_descriptor()
 *
 * @brief    Send string descriptor.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    str_ix      String index.
 *
 * @param    req_len     Requested length by the host.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/

#if (USBD_CFG_STR_EN == 1)
static sl_status_t usbd_core_send_string_descriptor(sli_usbd_device_t   *p_dev,
                                                    uint8_t             str_ix,
                                                    uint16_t            req_len)
{
  const char *p_str;
  size_t len;
#if (USBD_CFG_MS_OS_DESC_EN == 1)
  uint8_t ix;
#endif

  usbd_core_start_descriptor_write(p_dev, req_len);

  switch (str_ix) {
    case 0u:
      usbd_core_write_08b_to_descriptor_buf(p_dev, 4u);
      usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_STRING);
      usbd_core_write_16b_to_descriptor_buf(p_dev, p_dev->device_config.lang_id);
      break;

#if (USBD_CFG_MS_OS_DESC_EN == 1)
    case SLI_USBD_MICROSOFT_STR_IX:
      usbd_core_write_08b_to_descriptor_buf(p_dev, SLI_USBD_MICROSOFT_STR_LEN);
      usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_STRING);

      for (ix = 0u; ix < 7u; ix++) {
        usbd_core_write_08b_to_descriptor_buf(p_dev, (uint8_t)usbd_microsoft_signature_str[ix]);
        usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
      }

      usbd_core_write_08b_to_descriptor_buf(p_dev, p_dev->str_microsoft_vendor_code);
      usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);
      break;
#endif

    default:
      p_str = usbd_core_get_string_descriptor(p_dev, str_ix - 1u);
      if (p_str != NULL) {
        len = sl_strlen((char *)p_str);
        len = (2u * len) + 2u;
        len = SLI_USBD_GET_MIN(len, 255u);
        len = len - (len % 2u);

        usbd_core_write_08b_to_descriptor_buf(p_dev, (uint8_t)len);
        usbd_core_write_08b_to_descriptor_buf(p_dev, SL_USBD_DESC_TYPE_STRING);

        while (*p_str != '\0') {
          usbd_core_write_08b_to_descriptor_buf(p_dev, (uint8_t)*p_str);
          usbd_core_write_08b_to_descriptor_buf(p_dev, 0u);

