espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
          p_str++;
        }
      } else {
        return SL_STATUS_NULL_POINTER;
      }
      break;
  }

  return usbd_core_stop_descriptor_write(p_dev);
}
#endif

/****************************************************************************************************//**
 *                                           usbd_core_start_descriptor_write()
 *
 * @brief    Start write operation in the descriptor buffer.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    req_len     Requested length by the host.
 *******************************************************************************************************/
static void usbd_core_start_descriptor_write(sli_usbd_device_t   *p_dev,
                                             uint16_t            req_len)
{
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_ATOMIC();
  p_dev->desc_buf_index = 0u;
  p_dev->desc_buf_req_len = req_len;
  CORE_EXIT_ATOMIC();
}

/****************************************************************************************************//**
 *                                               usbd_core_stop_descriptor_write()
 *
 * @brief    Stop write operation in the descriptor buffer.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----   Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function might be called in two contexts: when a Get Descriptor standard request
 *               is received, or when a driver supporting standard request auto-reply queries the
 *               device, a configuration or a string descriptor. The descriptor needs to be sent on
 *               control endpoint 0 only if this function is called for a Get Descriptor standard
 *               request. If the function is called when a driver needs the descriptor, nothing has to
 *               be done.
 *******************************************************************************************************/
static sl_status_t usbd_core_stop_descriptor_write(sli_usbd_device_t *p_dev)
{
  uint32_t xfer_len;
  sl_status_t status;

  status = SL_STATUS_OK;

  // See Note #1.
  if (p_dev->actual_buf_ptr == p_dev->desc_buf_ptr) {
    if (p_dev->desc_buf_index > 0u) {
      uint32_t std_req_timeout;
      CORE_DECLARE_IRQ_STATE;

      CORE_ENTER_ATOMIC();
      std_req_timeout = usbd_ptr->std_req_timeout_ms;
      CORE_EXIT_ATOMIC();

      status = sl_usbd_core_write_control_sync(&p_dev->desc_buf_ptr[0u],
                                               (uint32_t)p_dev->desc_buf_index,
                                               std_req_timeout,
                                               (p_dev->desc_buf_req_len > 0u) ? true : false,
                                               &xfer_len);
    }
  }

  return status;
}

/****************************************************************************************************//**
 *                                           usbd_core_write_08b_to_descriptor_buf()
 *
 * @brief    Write 8-bit value in the descriptor buffer.
 *
 * @param    p_dev   Pointer to device.
 *
 * @param    val     8-bit value.
 *******************************************************************************************************/
static void usbd_core_write_08b_to_descriptor_buf(sli_usbd_device_t   *p_dev,
                                                  uint8_t             val)
{
  if (*(p_dev->desc_buf_status_ptr) == SL_STATUS_OK) {
    usbd_core_write_to_descriptor_buf(p_dev, &val, 1u);
  }
}

/****************************************************************************************************//**
 *                                               sl_usbd_core_write_16b_to_descriptor_buf()
 *
 * @brief    Write 16-bit value in the descriptor buffer.
 *
 * @param    p_dev   Pointer to device.
 *
 * @param    val     16-bit value.
 *******************************************************************************************************/
static void usbd_core_write_16b_to_descriptor_buf(sli_usbd_device_t   *p_dev,
                                                  uint16_t            val)
{
  if (*(p_dev->desc_buf_status_ptr) == SL_STATUS_OK) {
    uint8_t buf[2u];

    buf[0u] = (uint8_t)(val        & 0xFFu);
    buf[1u] = (uint8_t)((val >> 8u) & 0xFFu);

    usbd_core_write_to_descriptor_buf(p_dev, &buf[0u], 2u);
  }
}

/****************************************************************************************************//**
 *                                               usbd_core_write_to_descriptor_buf()
 *
 * @brief    USB device configuration write request.
 *
 * @param    p_dev   Pointer to device.
 *
 * @param    p_buf   Pointer to data buffer.
 *
 * @param    len     Buffer length.
 *
 * @note     (1) This function might be called in two contexts: when a Get Descriptor standard request
 *               is received, or when a driver supporting standard request auto-reply queries the
 *               device, a configuration or a string descriptor. In the Get Descriptor standard
 *               request case, if the buffer is full, a transfer on control endpoint 0 is done, before
 *               resuming to fill the buffer. In the case of a driver supporting standard request
 *               auto-reply, if the buffer is full, an error is set and the function exits.
 *
 * @note     (2) If an error is reported by sl_usbd_core_write_control_sync() during the construction of the descriptor,
 *               this pointer will store the error code, stop the rest of the data phase, skip the
 *               status phase and ensure that the control endpoint 0 is stalled to notify the host
 *               that an error has occurred.
 *******************************************************************************************************/
static void usbd_core_write_to_descriptor_buf(sli_usbd_device_t         *p_dev,
                                              const uint8_t             *p_buf,
                                              uint16_t                  len)
{
  uint8_t *p_desc;
  uint8_t buf_cur_ix;
  uint16_t len_req;
  uint32_t xfer_len;
  sl_status_t status;
  CORE_DECLARE_IRQ_STATE;

  p_desc = p_dev->actual_buf_ptr;
  buf_cur_ix = p_dev->desc_buf_index;
  len_req = p_dev->desc_buf_req_len;
  status = SL_STATUS_OK;

  while ((len_req != 0u)
         && (len != 0u)) {
    if (buf_cur_ix >= p_dev->desc_buf_max_len) {
      // Send data in response to std req. See Note #1.
      if (p_dev->actual_buf_ptr == p_dev->desc_buf_ptr) {
        uint32_t std_req_timeout;

