espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
        CORE_ENTER_ATOMIC();
        std_req_timeout = usbd_ptr->std_req_timeout_ms;
        CORE_EXIT_ATOMIC();

        buf_cur_ix = 0u;
        status = sl_usbd_core_write_control_sync(&p_dev->desc_buf_ptr[0u],
                                                 SLI_USBD_DESC_BUF_LEN,
                                                 std_req_timeout,
                                                 false,
                                                 &xfer_len);
        if (status != SL_STATUS_OK) {
          break;
        }
      } else {
        // Buf provided by driver is too small. See Note #1.
        len_req = 0u;
        status = SL_STATUS_ALLOCATION_FAILED;
      }
    } else {
      p_desc[buf_cur_ix] = *p_buf;
      p_buf++;
      len--;
      len_req--;
      buf_cur_ix++;
    }
  }

  CORE_ENTER_ATOMIC();
  p_dev->desc_buf_index = buf_cur_ix;
  p_dev->desc_buf_req_len = len_req;
  if (p_dev->desc_buf_status_ptr != NULL) {
    // See Note #2.
    *(p_dev->desc_buf_status_ptr) = status;
  }
  CORE_EXIT_ATOMIC();
}

/****************************************************************************************************//**
 *                                           usbd_core_get_configuration_structure()
 *
 * @brief    Get configuration structure.
 *
 * @param    p_dev       Pointer to device struct.
 *
 * @param    config_nbr  Configuration number.
 *
 * @return   Pointer to configuration structure, if no errors are returned.
 *
 *           Pointer to NULL,                    if any errors are returned.
 *******************************************************************************************************/
static sli_usbd_configuration_t *usbd_core_get_configuration_structure(const sli_usbd_device_t *p_dev,
                                                                       uint8_t                 config_nbr)
{
  sli_usbd_configuration_t *p_config;
  uint8_t cfg_val;
#if (USBD_CFG_OPTIMIZE_SPD == 0)
  uint8_t config_ix;
#endif

#if (USBD_CFG_HS_EN == 1)
  // SL_USBD_CONFIG_NBR_SPD_BIT will always be clear in FS.
  cfg_val = config_nbr & (uint8_t)(~SL_USBD_CONFIG_NBR_SPD_BIT);
#else
  cfg_val = config_nbr;
#endif

#if (USBD_CFG_OPTIMIZE_SPD == 1)  // Array implementation.
#if (USBD_CFG_HS_EN == 1)
  if (SL_IS_BIT_SET(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true) {
    // Chk if cfg nbr is valid.
    if (cfg_val >= p_dev->config_hs_total_nbr) {
      return (NULL);
    }
    // Get HS cfg struct.
    p_config = p_dev->config_hs_speed_table_ptrs[cfg_val];
  } else {
#endif
  // Chk if cfg nbr is valid.
  if (cfg_val >= p_dev->config_fs_total_nbr) {
    return (NULL);
  }
  // Get FS cfg struct.
  p_config = p_dev->config_fs_speed_table_ptrs[cfg_val];
#if (USBD_CFG_HS_EN == 1)
}
#endif
#else  // Linked-list implementation.
#if (USBD_CFG_HS_EN == 1)
  if (SL_IS_BIT_SET(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT)) {
    // Chk if cfg nbr is valid.
    if (cfg_val >= p_dev->config_hs_total_nbr) {
      return (NULL);
    }
    p_config = p_dev->config_hs_head_ptr;
  } else {
#endif
  // Chk if cfg nbr is valid.
  if (cfg_val >= p_dev->config_fs_total_nbr) {
    return (NULL);
  }
  p_config = p_dev->config_fs_head_ptr;
#if (USBD_CFG_HS_EN == 1)
}
#endif

  // Iterate thru list until to get cfg struct.
  for (config_ix = 0u; config_ix < cfg_val; config_ix++) {
    p_config = p_config->next_ptr;
  }
#endif

  return (p_config);
}

/****************************************************************************************************//**
 *                                               usbd_core_set_event()
 *
 * @brief    Send an event to the core task.
 *
 * @param    event   Event code :
 *                   SLI_USBD_EVENT_BUS_RESET    reset.
 *                   SLI_USBD_EVENT_BUS_SUSPEND  suspend.
 *                   SLI_USBD_EVENT_BUS_RESUME   resume.
 *                   SLI_USBD_EVENT_BUS_CONNECT     Connect.
 *                   SLI_USBD_EVENT_BUS_DISCONNECT  Disconnect.
 *                   SLI_USBD_EVENT_BUS_HS       High speed.
 *                   SLI_USBD_EVENT_ENDPOINT           Endpoint.
 *                   SLI_USBD_EVENT_SETUP        Setup.
 *******************************************************************************************************/
static void usbd_core_set_event(sli_usbd_event_code_t event)
{
  sli_usbd_core_event_t core_event;

  core_event.type = event;
  core_event.status = SL_STATUS_OK;

  sli_usbd_core_os_put_core_event(&core_event);
}

/****************************************************************************************************//**
 * Processes all core events and core operations
 *******************************************************************************************************/
void sli_usbd_core_task_handler(void)
{
  sli_usbd_core_event_t core_event;
  sli_usbd_device_t *p_dev;
  uint8_t ep_addr;
  sli_usbd_event_code_t event;
  sl_status_t xfer_status;
  sl_status_t status;

#if SL_USBD_AUTO_START_USB_DEVICE == 1
  sl_usbd_core_start_device();
#endif

  // event loop
  while (true) {
    // Wait for an event.
    status = sli_usbd_core_os_get_core_event((void *) &core_event);
    if (status == SL_STATUS_OK) {
      event = core_event.type;
      p_dev = &usbd_ptr->device;

      // Decode event.
      switch (event) {
        // Bus Events
        case SLI_USBD_EVENT_BUS_RESET:
        case SLI_USBD_EVENT_BUS_RESUME:
        case SLI_USBD_EVENT_BUS_CONNECT:
        case SLI_USBD_EVENT_BUS_HS:
        case SLI_USBD_EVENT_BUS_SUSPEND:
        case SLI_USBD_EVENT_BUS_DISCONNECT:
          usbd_core_process_event(p_dev, event);
          break;

        // Endpoint Events
        case SLI_USBD_EVENT_ENDPOINT:
          if (p_dev->state == SL_USBD_DEVICE_STATE_SUSPENDED) {
            p_dev->state = p_dev->state_prev;
          }
          ep_addr = core_event.endpoint_address;
          xfer_status = core_event.status;
          sl_usbd_core_endpoint_transfer_async(ep_addr, xfer_status);
          break;

        // Setup Events
        case SLI_USBD_EVENT_SETUP:
          SLI_USBD_DBG_STATS_DEV_INC(device_setup_event_nbr);
          if (p_dev->state == SL_USBD_DEVICE_STATE_SUSPENDED) {
            p_dev->state = p_dev->state_prev;
          }
          usbd_core_stdreq_handler(p_dev);
          break;

        default:
          break;
      }
    }
  }
}

/****************************************************************************************************//**
 *                                           usbd_core_process_event()
 *
 * @brief    Processes bus related events.
 *
 * @param    p_dev   Pointer to USB device.
 *
 * @param    -----  Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    event   Bus related events :
 *                   SLI_USBD_EVENT_BUS_RESET    reset.
 *                   SLI_USBD_EVENT_BUS_SUSPEND  suspend.
 *                   SLI_USBD_EVENT_BUS_RESUME   resume.
 *                   SLI_USBD_EVENT_BUS_CONNECT     Connect.
 *                   SLI_USBD_EVENT_BUS_DISCONNECT  Disconnect.
 *                   SLI_USBD_EVENT_BUS_HS       High speed.
 *
 * @note     (1) This prevents a suspend event to overwrite the internal status with a suspend state in
 *               the case of multiple suspend events in a row.
 *
 * @note     (2) USB Spec 2.0 section 9.1.1.6 states "When suspended, the USB device maintains any
 *               internal status, including its address and configuration."
 *
 * @note     (3) A suspend event is usually followed by a resume event when the bus activity comes back.
 *               But in some cases, after a suspend event, a reset event can be notified to the Core
 *               before a resume event. Thus, the internal state of the device should not be changed
 *               to the previous one.
 *******************************************************************************************************/
static void usbd_core_process_event(sli_usbd_device_t        *p_dev,
                                    sli_usbd_event_code_t    event)
{
  CORE_DECLARE_IRQ_STATE;

