espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  switch (event) {
    case SLI_USBD_EVENT_BUS_RESET:
      SLI_USBD_DBG_STATS_DEV_INC(device_reset_event_nbr);
      SLI_USBD_LOG_VRB_TO(SLI_USBD_LOG_BUS_CH, ("USBD Bus: reset"));

      CORE_ENTER_ATOMIC();
      if (p_dev->conn_status == false) {
        p_dev->conn_status = true;
        CORE_EXIT_ATOMIC();

        // Call application connect callback.
        sl_usbd_on_bus_event(SL_USBD_EVENT_BUS_CONNECT);
      } else {
        CORE_EXIT_ATOMIC();
      }

      // Close ctrl EP.
      sli_usbd_core_close_control_endpoint();

      if (p_dev->config_cur_nbr != SL_USBD_CONFIG_NBR_NONE) {
        // Close curr cfg.
        usbd_core_unset_configuration(p_dev);
      }

      // Open ctrl EP.
      sli_usbd_core_open_control_endpoint(p_dev->endpoint_max_ctrl_pkt_size);

      // Set dev in default state, reset dev speed.
      CORE_ENTER_ATOMIC();
      p_dev->address = 0u;
      p_dev->state = SL_USBD_DEVICE_STATE_DEFAULT;
      p_dev->speed = SL_USBD_DEVICE_SPEED_FULL;
      CORE_EXIT_ATOMIC();

      // Call application reset callback.
      sl_usbd_on_bus_event(SL_USBD_EVENT_BUS_RESET);

      break;

    case SLI_USBD_EVENT_BUS_SUSPEND:
      SLI_USBD_DBG_STATS_DEV_INC(device_suspend_event_nbr);
      SLI_USBD_LOG_VRB_TO(SLI_USBD_LOG_BUS_CH, ("USBD Bus: suspend"));

      CORE_ENTER_ATOMIC();
      // See Note #1.
      if (p_dev->state != SL_USBD_DEVICE_STATE_SUSPENDED) {
        // Save cur state (see Note #2).
        p_dev->state_prev = p_dev->state;
      }
      // Set  suspended state.
      p_dev->state = SL_USBD_DEVICE_STATE_SUSPENDED;
      CORE_EXIT_ATOMIC();

      // Call application suspend callback.
      sl_usbd_on_bus_event(SL_USBD_EVENT_BUS_SUSPEND);
      break;

    case SLI_USBD_EVENT_BUS_RESUME:
      SLI_USBD_DBG_STATS_DEV_INC(device_resume_event_nbr);
      SLI_USBD_LOG_VRB_TO(SLI_USBD_LOG_BUS_CH, ("USBD Bus: resume"));

      CORE_ENTER_ATOMIC();
      // See Note #3.
      if (p_dev->state == SL_USBD_DEVICE_STATE_SUSPENDED) {
        // Restore prev state.
        p_dev->state = p_dev->state_prev;
      }
      CORE_EXIT_ATOMIC();

      // Call application resume callback.
      sl_usbd_on_bus_event(SL_USBD_EVENT_BUS_RESUME);

      break;

    case SLI_USBD_EVENT_BUS_CONNECT:
      SLI_USBD_DBG_STATS_DEV_INC(device_conn_event_nbr);
      SLI_USBD_LOG_VRB_TO(SLI_USBD_LOG_BUS_CH, ("USBD Bus: Connect"));

      CORE_ENTER_ATOMIC();
      // Set attached state.
      p_dev->state = SL_USBD_DEVICE_STATE_ATTACHED;
      p_dev->conn_status = true;
      CORE_EXIT_ATOMIC();

      // Call application connect callback.
      sl_usbd_on_bus_event(SL_USBD_EVENT_BUS_CONNECT);

      break;

    case SLI_USBD_EVENT_BUS_DISCONNECT:
      SLI_USBD_DBG_STATS_DEV_INC(device_disconnect_event_nbr);
      SLI_USBD_LOG_VRB_TO(SLI_USBD_LOG_BUS_CH, ("USBD Bus: Disconnect"));

      // Close ctrl EP.
      sli_usbd_core_close_control_endpoint();

      if (p_dev->config_cur_nbr != SL_USBD_CONFIG_NBR_NONE) {
        // Close curr cfg.
        usbd_core_unset_configuration(p_dev);
      }

      CORE_ENTER_ATOMIC();
      // Set default address.
      p_dev->address = 0u;
      // Dev is not attached.
      p_dev->state = SL_USBD_DEVICE_STATE_INIT;
      // No active cfg.
      p_dev->config_cur_nbr = SL_USBD_CONFIG_NBR_NONE;
      p_dev->conn_status = false;
      CORE_EXIT_ATOMIC();

      // Call application disconnect callback.
      sl_usbd_on_bus_event(SL_USBD_EVENT_BUS_DISCONNECT);

      break;

    case SLI_USBD_EVENT_BUS_HS:
      SLI_USBD_LOG_VRB_TO(SLI_USBD_LOG_BUS_CH, ("USBD Bus: High Speed detection"));
#if (USBD_CFG_HS_EN == 1)
      CORE_ENTER_ATOMIC();
      p_dev->speed = SL_USBD_DEVICE_SPEED_HIGH;
      if (p_dev->state == SL_USBD_DEVICE_STATE_SUSPENDED) {
        p_dev->state = p_dev->state_prev;
      }
      CORE_EXIT_ATOMIC();
#endif
      break;

    case SLI_USBD_EVENT_ENDPOINT:
    case SLI_USBD_EVENT_SETUP:
    default:
      break;
  }
}

/****************************************************************************************************//**
 *                                               usbd_core_get_interface_structure()
 *
 * @brief    Gets the interface structure.
 *
 * @param    p_cfg   Pointer to configuration structure.
 *
 * @param    if_nbr  Interface number.
 *
 * @return   Pointer to interface structure, if no errors are returned.
 *
 *           Pointer to NULL,                if any errors are returned.
 *******************************************************************************************************/
static sli_usbd_interface_t *usbd_core_get_interface_structure(const sli_usbd_configuration_t *p_config,
                                                               uint8_t                        if_nbr)
{
  sli_usbd_interface_t *p_if;
#if (USBD_CFG_OPTIMIZE_SPD == 0)
  uint8_t if_ix;
#endif

  // Chk if IF nbr is valid.
  if (if_nbr >= p_config->interface_nbr_total) {
    return (NULL);
  }

  // Get IF struct.
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  p_if = p_config->interface_table_ptrs[if_nbr];
#else
  p_if = p_config->interface_head_ptr;

  for (if_ix = 0u; if_ix < if_nbr; if_ix++) {
    p_if = p_if->next_ptr;
  }
#endif

  return (p_if);
}

/****************************************************************************************************//**
 *                                           usbd_core_get_alt_interface_structure()
 *
 * @brief    Gets the alternate setting interface structure.
 *
 * @param    p_if        Pointer to interface structure.
 *
 * @param    if_alt_nbr  Alternate setting interface number.
 *
 * @return   Pointer to alternate setting interface structure, if no errors are returned.
 *
 *           Pointer to NULL,                                  if any errors are returned.
 *******************************************************************************************************/
static sli_usbd_alt_interface_t *usbd_core_get_alt_interface_structure(const sli_usbd_interface_t *p_if,
                                                                       uint8_t                    if_alt_nbr)
{
  sli_usbd_alt_interface_t *p_if_alt;
#if (USBD_CFG_OPTIMIZE_SPD == 0)
  uint8_t if_alt_ix;
#endif

  // Chk alt setting nbr.
  if (if_alt_nbr >= p_if->alt_nbr_total) {
    return (NULL);
  }

  // Get alt IF struct.
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  p_if_alt = p_if->alt_table_ptrs[if_alt_nbr];
#else
  p_if_alt = p_if->alt_head_ptr;

