espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  for (if_alt_ix = 0u; if_alt_ix < if_alt_nbr; if_alt_ix++) {
    p_if_alt = p_if_alt->next_ptr;
  }
#endif

  return (p_if_alt);
}

/****************************************************************************************************//**
 *                                               usbd_core_open_alt_interface()
 *
 * @brief    Opens all endpoints from the specified alternate setting.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----     Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    if_nbr      Interface number.
 *
 * @param    p_if_alt    Pointer to alternate setting interface.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
static sl_status_t usbd_core_open_alt_interface(sli_usbd_device_t              *p_dev,
                                                uint8_t                        if_nbr,
                                                const sli_usbd_alt_interface_t *p_if_alt)
{
  uint8_t ep_nbr;
  uint8_t ep_phy_nbr;
  bool valid;
  sli_usbd_endpoint_info_t *p_ep;
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  uint32_t ep_alloc_map;
#endif
  sl_status_t status;
  CORE_DECLARE_IRQ_STATE;

  valid = true;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  ep_alloc_map = p_if_alt->endpoint_table_map;
  while (ep_alloc_map != 0x00u) {
    ep_nbr = (uint8_t)__CLZ(__RBIT(ep_alloc_map));
    p_ep = p_if_alt->endpoint_table_ptrs[ep_nbr];
    ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(p_ep->address);

    CORE_ENTER_ATOMIC();
    p_dev->endpoint_interface_table[ep_phy_nbr] = if_nbr;
    CORE_EXIT_ATOMIC();

    status = sli_usbd_core_open_endpoint(p_ep->address,
                                         p_ep->max_pkt_size,
                                         p_ep->attrib,
                                         p_ep->interval);
    if (status != SL_STATUS_OK) {
      valid = false;
      break;
    }

    SL_CLEAR_BIT(ep_alloc_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
  }
#else
  p_ep = p_if_alt->endpoint_head_ptr;

  for (ep_nbr = 0u; ep_nbr < p_if_alt->endpoint_nbr_total; ep_nbr++) {
    ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(p_ep->address);

    CORE_ENTER_ATOMIC();
    p_dev->endpoint_interface_table[ep_phy_nbr] = if_nbr;
    CORE_EXIT_ATOMIC();

    status = sli_usbd_core_open_endpoint(p_ep->address,
                                         p_ep->max_pkt_size,
                                         p_ep->attrib,
                                         p_ep->interval);
    if (status != SL_STATUS_OK) {
      valid = false;
      break;
    }

    p_ep = p_ep->next_ptr;
  }
#endif

  if (valid == true) {
    status = SL_STATUS_OK;
  } else {
    usbd_core_close_alt_interface(p_dev, p_if_alt);
  }

  return status;
}

/****************************************************************************************************//**
 *                                           usbd_core_close_alt_interface()
 *
 * @brief    Closes all endpoints from the specified alternate setting.
 *
 * @param    p_dev       Pointer to USB device.
 *
 * @param    -----       Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    p_if_alt    Pointer to alternate setting interface.
 *******************************************************************************************************/
static void usbd_core_close_alt_interface(sli_usbd_device_t              *p_dev,
                                          const sli_usbd_alt_interface_t *p_if_alt)
{
  uint8_t ep_nbr;
  uint8_t ep_phy_nbr;
  sli_usbd_endpoint_info_t *p_ep;
#if (USBD_CFG_OPTIMIZE_SPD == 1)
  uint32_t ep_alloc_map;
#endif
  CORE_DECLARE_IRQ_STATE;

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  ep_alloc_map = p_if_alt->endpoint_table_map;
  while (ep_alloc_map != 0x00u) {
    ep_nbr = (uint8_t)__CLZ(__RBIT(ep_alloc_map));
    p_ep = p_if_alt->endpoint_table_ptrs[ep_nbr];
    ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(p_ep->address);

    CORE_ENTER_ATOMIC();
    p_dev->endpoint_interface_table[ep_phy_nbr] = SL_USBD_INTERFACE_NBR_NONE;
    CORE_EXIT_ATOMIC();

    sli_usbd_core_close_endpoint(p_ep->address);

    SL_CLEAR_BIT(ep_alloc_map, SLI_USBD_SINGLE_BIT_MASK_32(ep_nbr));
  }
#else
  p_ep = p_if_alt->endpoint_head_ptr;

  for (ep_nbr = 0u; ep_nbr < p_if_alt->endpoint_nbr_total; ep_nbr++) {
    ep_phy_nbr = SL_USBD_ENDPOINT_ADDR_TO_PHY(p_ep->address);

    CORE_ENTER_ATOMIC();
    p_dev->endpoint_interface_table[ep_phy_nbr] = SL_USBD_INTERFACE_NBR_NONE;
    CORE_EXIT_ATOMIC();

    sli_usbd_core_close_endpoint(p_ep->address);

    p_ep = p_ep->next_ptr;
  }
#endif
}

/****************************************************************************************************//**
 *                                           usbd_core_get_interface_group_structure()
 *
 * @brief    Gets the interface group structure.
 *
 * @param    p_cfg       Pointer to configuration structure.
 *
 * @param    if_grp_nbr  Interface number.
 *
 * @return   Pointer to interface group structure, if no errors are returned.
 *
 *           Pointer to NULL,                      if any errors are returned.
 *******************************************************************************************************/
static sli_usbd_interface_group_t *usbd_core_get_interface_group_structure(const sli_usbd_configuration_t *p_config,
                                                                           uint8_t                        if_grp_nbr)
{
  sli_usbd_interface_group_t *p_if_grp;
#if (USBD_CFG_OPTIMIZE_SPD == 0)
  uint8_t if_grp_ix;
#endif

#if (USBD_CFG_OPTIMIZE_SPD == 1)
  p_if_grp = p_config->interface_group_table_ptrs[if_grp_nbr];
#else
  p_if_grp = p_config->interface_group_head_ptr;

  for (if_grp_ix = 0u; if_grp_ix < if_grp_nbr; if_grp_ix++) {
    p_if_grp = p_if_grp->next_ptr;
  }
#endif

  return (p_if_grp);
}

/****************************************************************************************************//**
 *                                               usbd_core_add_string()
 *
 * @brief    Adds the string to the USB device.
 *
 * @param    p_dev   Pointer to device structure.
 *
 * @param    -----   Argument validated in the caller(s).
 *
 * @param    p_str   Pointer to string to add (see Note #1).
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB spec 2.0 chapter 9.5 states "Where appropriate, descriptors contain references
 *               to string descriptors that provide displayable information describing a descriptor
 *               in human-readable form. The inclusion of string descriptors is optional.  However,
 *               the reference fields within descriptors are mandatory. If a device does not support
 *               string descriptors, string reference fields must be reset to zero to indicate no
 *               string descriptor is available.
 *
 *               Since string descriptors are optional, 'p_str' could be a NULL pointer.
 *******************************************************************************************************/

#if (USBD_CFG_STR_EN == 1)
static sl_status_t usbd_core_add_string(sli_usbd_device_t       *p_dev,
                                        const char              *p_str)
{
  uint8_t str_ix;
  CORE_DECLARE_IRQ_STATE;

