espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_core.c
  // Return if NULL ptr.
  if (p_str == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  for (str_ix = 0u; str_ix < p_dev->str_max_index; str_ix++) {
    if (p_str == p_dev->str_descriptor_table[str_ix]) {
      // Str already stored in tbl.
      return SL_STATUS_OK;
    }
  }

  CORE_ENTER_ATOMIC();
  // Get curr str tbl ix.
  str_ix = p_dev->str_max_index;

  // Chk if str can be stored in tbl.
  if (str_ix >= usbd_ptr->str_quantity_per_device) {
    CORE_EXIT_ATOMIC();
    return SL_STATUS_ALLOCATION_FAILED;
  }

  p_dev->str_descriptor_table[str_ix] = (char *)p_str;
  p_dev->str_max_index++;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 *                                               usbd_core_get_string_descriptor()
 *
 * @brief    Gets the string pointer.
 *
 * @param    p_dev       Pointer to device.
 *
 * @param    -----    Argument validate by the caller(s).
 *
 * @param    str_nbr     Number of the string to obtain.
 *
 * @return   Pointer to requested string, if no errors are returned.
 *
 *           Pointer to NULL,             if any errors are returned.
 *******************************************************************************************************/

#if (USBD_CFG_STR_EN == 1)
static const char *usbd_core_get_string_descriptor(const sli_usbd_device_t *p_dev,
                                                   uint8_t                 str_nbr)
{
  const char *p_str;

  if (str_nbr > p_dev->str_max_index) {
    return (NULL);
  }

  p_str = p_dev->str_descriptor_table[str_nbr];
  return (p_str);
}
#endif

/****************************************************************************************************//**
 *                                           usbd_core_get_string_index()
 *
 * @brief    Get string index.
 *
 * @param    p_dev   Pointer to device.
 *
 * @param    -----  Argument validated in 'USBD_DevSetupPkt()' before posting the event to queue.
 *
 * @param    p_str   Pointer to string.
 *
 * @return   String index.
 *******************************************************************************************************/

#if (USBD_CFG_STR_EN == 1)
static uint8_t usbd_core_get_string_index(const sli_usbd_device_t *p_dev,
                                          const char              *p_str)
{
  uint8_t str_ix;

  // Return if a NULL pointer.
  if (p_str == NULL) {
    return (0u);
  }

  for (str_ix = 0u; str_ix < p_dev->str_max_index; str_ix++) {
    if (p_str == p_dev->str_descriptor_table[str_ix]) {
      // Str already stored in tbl.
      return (str_ix + 1u);
    }
  }

  return (0u);
}
#endif
